; ModuleID = 'solana_frozen_abi.ce94849e-cgu.0'
source_filename = "solana_frozen_abi.ce94849e-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"std::sync::atomic::AtomicUsize" = type { i64 }
%"std::string::String" = type { %"std::vec::Vec<u8>" }
%"std::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"std::panic::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"std::ops::RangeFull" = type {}
%"std::slice::ChunksExactMut<u8>" = type { { [0 x i8]*, i64 }, { [0 x i8]*, i64 }, i64 }
%"std::option::Option<usize>::Some" = type { [1 x i64], i64 }
%"[closure@std::iter::Iterator::for_each::call<std::string::String, [closure@<std::vec::Vec<std::string::String> as std::vec::spec_extend::SpecExtend<std::string::String, std::iter::Map<std::slice::Iter<&str>, [closure@/root/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-frozen-abi-1.10.0/src/abi_digester.rs:141:18: 145:14]>>>::spec_extend::{closure#0}]>::{closure#0}]" = type { %"[closure@<std::vec::Vec<std::string::String> as std::vec::spec_extend::SpecExtend<std::string::String, std::iter::Map<std::slice::Iter<&str>, [closure@/root/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-frozen-abi-1.10.0/src/abi_digester.rs:141:18: 145:14]>>>::spec_extend::{closure#0}]" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !5, identifier: "vtable")
!4 = !{}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&String", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !7, file: !2, size: 192, align: 64, elements: !9, templateParams: !4, identifier: "e28b11170a43b0ee5a473b5b2ec3c65f")
!7 = !DINamespace(name: "string", scope: !8)
!8 = !DINamespace(name: "alloc", scope: null)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !6, file: !2, baseType: !11, size: 192, align: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !12, file: !2, size: 192, align: 64, elements: !13, templateParams: !37, identifier: "ca400f85b78e93ba5bca8a9ad1767585")
!12 = !DINamespace(name: "vec", scope: !8)
!13 = !{!14, !39}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !11, file: !2, baseType: !15, size: 128, align: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !16, file: !2, size: 128, align: 64, elements: !17, templateParams: !37, identifier: "991210d0a52bfaad42f8b613238cdb8")
!16 = !DINamespace(name: "raw_vec", scope: !8)
!17 = !{!18, !32, !34}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, file: !2, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !20, file: !2, size: 64, align: 64, elements: !23, templateParams: !30, identifier: "76ad11c5918345b022d81965d637386")
!20 = !DINamespace(name: "unique", scope: !21)
!21 = !DINamespace(name: "ptr", scope: !22)
!22 = !DINamespace(name: "core", scope: null)
!23 = !{!24, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !19, file: !2, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !19, file: !2, baseType: !28, align: 8)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !29, file: !2, align: 8, elements: !4, templateParams: !30, identifier: "d9180f7e28d2761ea11f32bda27bf4b6")
!29 = !DINamespace(name: "marker", scope: !22)
!30 = !{!31}
!31 = !DITemplateTypeParameter(name: "T", type: !26)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !15, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !15, file: !2, baseType: !35, align: 8)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !36, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "82a28e8ea0dcac18287e7b3f6b37e370")
!36 = !DINamespace(name: "alloc", scope: !8)
!37 = !{!31, !38}
!38 = !DITemplateTypeParameter(name: "A", type: !35)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, file: !2, baseType: !33, size: 64, align: 64, offset: 128)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !43, identifier: "vtable")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowMutError", scope: !44, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "7eeb4ba8d26e094f613268deed6823e1")
!44 = !DINamespace(name: "cell", scope: !22)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !48, identifier: "vtable")
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowError", scope: !44, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "7655c1c4be872185871ec07cf408bf33")
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !51, isLocal: true, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !52, identifier: "vtable")
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !53, file: !2, size: 128, align: 64, elements: !56, templateParams: !4, identifier: "f761a71e8fab46044eaaa61bad5ad81f")
!53 = !DINamespace(name: "error", scope: !54)
!54 = !DINamespace(name: "io", scope: !55)
!55 = !DINamespace(name: "std", scope: null)
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !52, file: !2, baseType: !58, size: 128, align: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !53, file: !2, size: 128, align: 64, elements: !59, identifier: "21968c09157b928651e5f2d469ad8a26")
!59 = !{!60}
!60 = !DICompositeType(tag: DW_TAG_variant_part, scope: !53, file: !2, size: 128, align: 64, elements: !61, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26_variant_part", discriminator: !149)
!61 = !{!62, !67, !114, !124}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !60, file: !2, baseType: !63, size: 128, align: 64, extraData: i64 0)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !58, file: !2, size: 128, align: 64, elements: !64, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26::Os")
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !63, file: !2, baseType: !66, size: 32, align: 32, offset: 32)
!66 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !60, file: !2, baseType: !68, size: 128, align: 64, extraData: i64 1)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !58, file: !2, size: 128, align: 64, elements: !69, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26::Simple")
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !71, size: 8, align: 8, offset: 8)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !53, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagEnumClass, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!73 = !DIEnumerator(name: "NotFound", value: 0)
!74 = !DIEnumerator(name: "PermissionDenied", value: 1)
!75 = !DIEnumerator(name: "ConnectionRefused", value: 2)
!76 = !DIEnumerator(name: "ConnectionReset", value: 3)
!77 = !DIEnumerator(name: "HostUnreachable", value: 4)
!78 = !DIEnumerator(name: "NetworkUnreachable", value: 5)
!79 = !DIEnumerator(name: "ConnectionAborted", value: 6)
!80 = !DIEnumerator(name: "NotConnected", value: 7)
!81 = !DIEnumerator(name: "AddrInUse", value: 8)
!82 = !DIEnumerator(name: "AddrNotAvailable", value: 9)
!83 = !DIEnumerator(name: "NetworkDown", value: 10)
!84 = !DIEnumerator(name: "BrokenPipe", value: 11)
!85 = !DIEnumerator(name: "AlreadyExists", value: 12)
!86 = !DIEnumerator(name: "WouldBlock", value: 13)
!87 = !DIEnumerator(name: "NotADirectory", value: 14)
!88 = !DIEnumerator(name: "IsADirectory", value: 15)
!89 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16)
!90 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17)
!91 = !DIEnumerator(name: "FilesystemLoop", value: 18)
!92 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19)
!93 = !DIEnumerator(name: "InvalidInput", value: 20)
!94 = !DIEnumerator(name: "InvalidData", value: 21)
!95 = !DIEnumerator(name: "TimedOut", value: 22)
!96 = !DIEnumerator(name: "WriteZero", value: 23)
!97 = !DIEnumerator(name: "StorageFull", value: 24)
!98 = !DIEnumerator(name: "NotSeekable", value: 25)
!99 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26)
!100 = !DIEnumerator(name: "FileTooLarge", value: 27)
!101 = !DIEnumerator(name: "ResourceBusy", value: 28)
!102 = !DIEnumerator(name: "ExecutableFileBusy", value: 29)
!103 = !DIEnumerator(name: "Deadlock", value: 30)
!104 = !DIEnumerator(name: "CrossesDevices", value: 31)
!105 = !DIEnumerator(name: "TooManyLinks", value: 32)
!106 = !DIEnumerator(name: "FilenameTooLong", value: 33)
!107 = !DIEnumerator(name: "ArgumentListTooLong", value: 34)
!108 = !DIEnumerator(name: "Interrupted", value: 35)
!109 = !DIEnumerator(name: "Unsupported", value: 36)
!110 = !DIEnumerator(name: "UnexpectedEof", value: 37)
!111 = !DIEnumerator(name: "OutOfMemory", value: 38)
!112 = !DIEnumerator(name: "Other", value: 39)
!113 = !DIEnumerator(name: "Uncategorized", value: 40)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !60, file: !2, baseType: !115, size: 128, align: 64, extraData: i64 2)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !58, file: !2, size: 128, align: 64, elements: !116, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26::SimpleMessage")
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !115, file: !2, baseType: !71, size: 8, align: 8, offset: 8)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !115, file: !2, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !120, size: 64, align: 64, dwarfAddressSpace: 0)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !121, templateParams: !4, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !120, file: !2, baseType: !25, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !120, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !60, file: !2, baseType: !125, size: 128, align: 64, extraData: i64 3)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !58, file: !2, size: 128, align: 64, elements: !126, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26::Custom")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !125, file: !2, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !53, file: !2, size: 192, align: 64, elements: !130, templateParams: !4, identifier: "c79edc4407a645b1d40c480671ee721f")
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !129, file: !2, baseType: !71, size: 8, align: 8, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !129, file: !2, baseType: !133, size: 128, align: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<(dyn std::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", scope: !134, file: !2, size: 128, align: 64, elements: !135, templateParams: !143, identifier: "d02503b268adbc38e1ce7e305a5e4fd")
!134 = !DINamespace(name: "boxed", scope: !8)
!135 = !{!136, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !133, file: !2, baseType: !137, size: 64, align: 64, flags: DIFlagArtificial)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !133, file: !2, baseType: !139, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !140, size: 64, align: 64, dwarfAddressSpace: 0)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 192, align: 64, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 3, lowerBound: 0)
!143 = !{!144, !38}
!144 = !DITemplateTypeParameter(name: "T", type: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn std::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !146, templateParams: !4, identifier: "17cf14261d4f40a03288a418a7711d4b")
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !145, file: !2, baseType: !137, size: 64, align: 64, flags: DIFlagArtificial)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !145, file: !2, baseType: !139, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !53, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagArtificial)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !153, identifier: "vtable")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "TryFromSliceError", scope: !154, file: !2, align: 8, elements: !155, templateParams: !4, identifier: "7d433bee47af4cec79597a74e6cd8a5c")
!154 = !DINamespace(name: "array", scope: !22)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !153, file: !2, baseType: !157, align: 8)
!157 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !161, identifier: "vtable")
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "FromUtf8Error", scope: !7, file: !2, size: 320, align: 64, elements: !162, templateParams: !4, identifier: "b5f33b3520e807ba67585e7a2e484460")
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !161, file: !2, baseType: !11, size: 192, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !161, file: !2, baseType: !165, size: 128, align: 64, offset: 192)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !166, file: !2, size: 128, align: 64, elements: !168, templateParams: !4, identifier: "23e62222a878f93eb05b6b1bf847e978")
!166 = !DINamespace(name: "error", scope: !167)
!167 = !DINamespace(name: "str", scope: !22)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !165, file: !2, baseType: !33, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !165, file: !2, baseType: !171, size: 16, align: 8, offset: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !172, file: !2, size: 16, align: 8, elements: !173, identifier: "b8190189d3b92788fb333a57bdc50a8b")
!172 = !DINamespace(name: "option", scope: !22)
!173 = !{!174}
!174 = !DICompositeType(tag: DW_TAG_variant_part, scope: !172, file: !2, size: 16, align: 8, elements: !175, templateParams: !30, identifier: "b8190189d3b92788fb333a57bdc50a8b_variant_part", discriminator: !182)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !174, file: !2, baseType: !177, size: 16, align: 8, extraData: i64 0)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !171, file: !2, size: 16, align: 8, elements: !4, templateParams: !30, identifier: "b8190189d3b92788fb333a57bdc50a8b::None")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !174, file: !2, baseType: !179, size: 16, align: 8, extraData: i64 1)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !171, file: !2, size: 16, align: 8, elements: !180, templateParams: !30, identifier: "b8190189d3b92788fb333a57bdc50a8b::Some")
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !179, file: !2, baseType: !26, size: 8, align: 8, offset: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, scope: !172, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagArtificial)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !186, identifier: "vtable")
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidOutputSize", scope: !187, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "2617244585b4f344c6cf3be667e783ea")
!187 = !DINamespace(name: "digest", scope: null)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !191, identifier: "vtable")
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !192, file: !2, align: 8, elements: !194, identifier: "a70a2e436c0463317b9b940cba899be")
!192 = !DINamespace(name: "encode", scope: !193)
!193 = !DINamespace(name: "bs58", scope: null)
!194 = !{!195}
!195 = !DICompositeType(tag: DW_TAG_variant_part, scope: !192, file: !2, align: 8, elements: !196, templateParams: !4, identifier: "a70a2e436c0463317b9b940cba899be_variant_part")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "BufferTooSmall", scope: !195, file: !2, baseType: !198, align: 8)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "BufferTooSmall", scope: !191, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "a70a2e436c0463317b9b940cba899be::BufferTooSmall")
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !202, identifier: "vtable")
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowedPlaceholder", scope: !203, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "474049c373d1f181480db256ce045d6b")
!203 = !DINamespace(name: "fmt", scope: !204)
!204 = !DINamespace(name: "{impl#29}", scope: !205)
!205 = !DINamespace(name: "fmt", scope: !22)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !209, identifier: "vtable")
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ref<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>", scope: !44, file: !2, size: 128, align: 64, elements: !210, templateParams: !245, identifier: "491a43fd26338de55d181dd245207187")
!210 = !{!211, !231}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !209, file: !2, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Vec<alloc::string::String, alloc::alloc::Global>", baseType: !213, size: 64, align: 64, dwarfAddressSpace: 0)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::string::String, alloc::alloc::Global>", scope: !12, file: !2, size: 192, align: 64, elements: !214, templateParams: !229, identifier: "f6ce5ca38ed032bf9b4925ea4cb76e0c")
!214 = !{!215, !230}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !213, file: !2, baseType: !216, size: 128, align: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::string::String, alloc::alloc::Global>", scope: !16, file: !2, size: 128, align: 64, elements: !217, templateParams: !229, identifier: "6da9569b3319299b5bcd1d6bfa8b8290")
!217 = !{!218, !227, !228}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !216, file: !2, baseType: !219, size: 64, align: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::string::String>", scope: !20, file: !2, size: 64, align: 64, elements: !220, templateParams: !225, identifier: "f6531494c1e5e2bb70de36ef19732a3d")
!220 = !{!221, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !219, file: !2, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const String", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !219, file: !2, baseType: !224, align: 8)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::string::String>", scope: !29, file: !2, align: 8, elements: !4, templateParams: !225, identifier: "a080816dce26a3cec12b7f7c8ea33ca9")
!225 = !{!226}
!226 = !DITemplateTypeParameter(name: "T", type: !6)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !216, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !216, file: !2, baseType: !35, align: 8)
!229 = !{!226, !38}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !213, file: !2, baseType: !33, size: 64, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !209, file: !2, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowRef", scope: !44, file: !2, size: 64, align: 64, elements: !233, templateParams: !4, identifier: "b4437e329e4ea0a1b63a71ca0420d36c")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !232, file: !2, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Cell<isize>", baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<isize>", scope: !44, file: !2, size: 64, align: 64, elements: !237, templateParams: !243, identifier: "4e95b0f2a1a1d843af31431b8d46a5a9")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !236, file: !2, baseType: !239, size: 64, align: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<isize>", scope: !44, file: !2, size: 64, align: 64, elements: !240, templateParams: !243, identifier: "a478319df2321c642b07e6e189247bf")
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !239, file: !2, baseType: !242, size: 64, align: 64)
!242 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!243 = !{!244}
!244 = !DITemplateTypeParameter(name: "T", type: !242)
!245 = !{!246}
!246 = !DITemplateTypeParameter(name: "T", type: !213)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !250, identifier: "vtable")
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Rc<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>", baseType: !251, size: 64, align: 64, dwarfAddressSpace: 0)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>", scope: !252, file: !2, size: 64, align: 64, elements: !253, templateParams: !280, identifier: "d0615c53527096e6097830b4b675024")
!252 = !DINamespace(name: "rc", scope: !8)
!253 = !{!254, !284}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !251, file: !2, baseType: !255, size: 64, align: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>>", scope: !256, file: !2, size: 64, align: 64, elements: !257, templateParams: !282, identifier: "a968ea7a80fe69b7f174232645eb8dfc")
!256 = !DINamespace(name: "non_null", scope: !21)
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !255, file: !2, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>", baseType: !260, size: 64, align: 64, dwarfAddressSpace: 0)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>", scope: !252, file: !2, size: 384, align: 64, elements: !261, templateParams: !280, identifier: "a98cfd485d1e3463d92d2224c36c7f67")
!261 = !{!262, !271, !272}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !260, file: !2, baseType: !263, size: 64, align: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !44, file: !2, size: 64, align: 64, elements: !264, templateParams: !269, identifier: "d610ccc56ed6bc2d95c5846672673907")
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !263, file: !2, baseType: !266, size: 64, align: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !44, file: !2, size: 64, align: 64, elements: !267, templateParams: !269, identifier: "df37019b130d2c01fbc34865afbd6522")
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !266, file: !2, baseType: !33, size: 64, align: 64)
!269 = !{!270}
!270 = !DITemplateTypeParameter(name: "T", type: !33)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !260, file: !2, baseType: !263, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !260, file: !2, baseType: !273, size: 256, align: 64, offset: 128)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>", scope: !44, file: !2, size: 256, align: 64, elements: !274, templateParams: !245, identifier: "920137135f99f0892fb550aa3cfeac12")
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !273, file: !2, baseType: !236, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !273, file: !2, baseType: !277, size: 192, align: 64, offset: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>", scope: !44, file: !2, size: 192, align: 64, elements: !278, templateParams: !245, identifier: "8383a9c9dd3e8cfbb1b7d2c9759fd8c1")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !277, file: !2, baseType: !213, size: 192, align: 64)
!280 = !{!281}
!281 = !DITemplateTypeParameter(name: "T", type: !273)
!282 = !{!283}
!283 = !DITemplateTypeParameter(name: "T", type: !260)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !251, file: !2, baseType: !285, align: 8)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>>", scope: !29, file: !2, align: 8, elements: !4, templateParams: !282, identifier: "6cdecbbd2a86db4a6b4b1f35634e9560")
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !289, identifier: "vtable")
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !293, identifier: "vtable")
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !294, size: 64, align: 64, dwarfAddressSpace: 0)
!294 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !298, identifier: "vtable")
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Option<alloc::string::String>", baseType: !299, size: 64, align: 64, dwarfAddressSpace: 0)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::string::String>", scope: !172, file: !2, size: 192, align: 64, elements: !300, identifier: "b155ee91cec4d8dc386ce30033d0e522")
!300 = !{!301}
!301 = !DICompositeType(tag: DW_TAG_variant_part, scope: !172, file: !2, size: 192, align: 64, elements: !302, templateParams: !225, identifier: "b155ee91cec4d8dc386ce30033d0e522_variant_part", discriminator: !309)
!302 = !{!303, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !301, file: !2, baseType: !304, size: 192, align: 64, extraData: i64 0)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !299, file: !2, size: 192, align: 64, elements: !4, templateParams: !225, identifier: "b155ee91cec4d8dc386ce30033d0e522::None")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !301, file: !2, baseType: !306, size: 192, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !299, file: !2, size: 192, align: 64, elements: !307, templateParams: !225, identifier: "b155ee91cec4d8dc386ce30033d0e522::Some")
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !306, file: !2, baseType: !6, size: 192, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, scope: !172, file: !2, baseType: !310, size: 64, align: 64, flags: DIFlagArtificial)
!310 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !119, identifier: "vtable")
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !317, identifier: "vtable")
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Box<solana_frozen_abi::abi_digester::DigestError, alloc::alloc::Global>", baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<solana_frozen_abi::abi_digester::DigestError, alloc::alloc::Global>", baseType: !319, size: 64, align: 64, dwarfAddressSpace: 0)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "DigestError", scope: !320, file: !2, size: 384, align: 64, elements: !322, identifier: "cdbcd1444cb87a06f385bd71f3c373ad")
!320 = !DINamespace(name: "abi_digester", scope: !321)
!321 = !DINamespace(name: "solana_frozen_abi", scope: null)
!322 = !{!323}
!323 = !DICompositeType(tag: DW_TAG_variant_part, scope: !320, file: !2, size: 384, align: 64, elements: !324, templateParams: !4, identifier: "cdbcd1444cb87a06f385bd71f3c373ad_variant_part", discriminator: !340)
!324 = !{!325, !327, !332, !338}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "NoneIsSerialized", scope: !323, file: !2, baseType: !326, size: 384, align: 64, extraData: i64 0)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoneIsSerialized", scope: !319, file: !2, size: 384, align: 64, elements: !4, templateParams: !4, identifier: "cdbcd1444cb87a06f385bd71f3c373ad::NoneIsSerialized")
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !323, file: !2, baseType: !328, size: 384, align: 64, extraData: i64 1)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", scope: !319, file: !2, size: 384, align: 64, elements: !329, templateParams: !4, identifier: "cdbcd1444cb87a06f385bd71f3c373ad::Node")
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !328, file: !2, baseType: !120, size: 128, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !328, file: !2, baseType: !318, size: 64, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", scope: !323, file: !2, baseType: !333, size: 384, align: 64, extraData: i64 2)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Leaf", scope: !319, file: !2, size: 384, align: 64, elements: !334, templateParams: !4, identifier: "cdbcd1444cb87a06f385bd71f3c373ad::Leaf")
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !333, file: !2, baseType: !120, size: 128, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !333, file: !2, baseType: !120, size: 128, align: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !333, file: !2, baseType: !318, size: 64, align: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ArithmeticOverflow", scope: !323, file: !2, baseType: !339, size: 384, align: 64, extraData: i64 3)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArithmeticOverflow", scope: !319, file: !2, size: 384, align: 64, elements: !4, templateParams: !4, identifier: "cdbcd1444cb87a06f385bd71f3c373ad::ArithmeticOverflow")
!340 = !DIDerivedType(tag: DW_TAG_member, scope: !320, file: !2, baseType: !310, size: 64, align: 64, flags: DIFlagArtificial)
!341 = !{i32 7, !"PIC Level", i32 2}
!342 = !{i32 2, !"Debug Info Version", i32 3}
!343 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !344, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !345, globals: !389)
!344 = !DIFile(filename: "/root/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-frozen-abi-1.10.0/src/lib.rs", directory: "/root/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-frozen-abi-1.10.0")
!345 = !{!346, !71, !355, !360, !368, !377, !383, !387}
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LevelFilter", scope: !347, file: !2, baseType: !310, size: 64, align: 64, flags: DIFlagEnumClass, elements: !348)
!347 = !DINamespace(name: "log", scope: null)
!348 = !{!349, !350, !351, !352, !353, !354}
!349 = !DIEnumerator(name: "Off", value: 0, isUnsigned: true)
!350 = !DIEnumerator(name: "Error", value: 1, isUnsigned: true)
!351 = !DIEnumerator(name: "Warn", value: 2, isUnsigned: true)
!352 = !DIEnumerator(name: "Info", value: 3, isUnsigned: true)
!353 = !DIEnumerator(name: "Debug", value: 4, isUnsigned: true)
!354 = !DIEnumerator(name: "Trace", value: 5, isUnsigned: true)
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !356, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagEnumClass, elements: !357)
!356 = !DINamespace(name: "result", scope: !22)
!357 = !{!358, !359}
!358 = !DIEnumerator(name: "Ok", value: 0)
!359 = !DIEnumerator(name: "Err", value: 1)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !361, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagEnumClass, elements: !363)
!361 = !DINamespace(name: "v1", scope: !362)
!362 = !DINamespace(name: "rt", scope: !205)
!363 = !{!364, !365, !366, !367}
!364 = !DIEnumerator(name: "Left", value: 0)
!365 = !DIEnumerator(name: "Right", value: 1)
!366 = !DIEnumerator(name: "Center", value: 2)
!367 = !DIEnumerator(name: "Unknown", value: 3)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !369, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagEnumClass, elements: !371)
!369 = !DINamespace(name: "atomic", scope: !370)
!370 = !DINamespace(name: "sync", scope: !22)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIEnumerator(name: "Relaxed", value: 0)
!373 = !DIEnumerator(name: "Release", value: 1)
!374 = !DIEnumerator(name: "Acquire", value: 2)
!375 = !DIEnumerator(name: "AcqRel", value: 3)
!376 = !DIEnumerator(name: "SeqCst", value: 4)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !378, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagEnumClass, elements: !379)
!378 = !DINamespace(name: "panicking", scope: !22)
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "Eq", value: 0)
!381 = !DIEnumerator(name: "Ne", value: 1)
!382 = !DIEnumerator(name: "Match", value: 2)
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !16, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagEnumClass, elements: !384)
!384 = !{!385, !386}
!385 = !DIEnumerator(name: "Uninitialized", value: 0)
!386 = !DIEnumerator(name: "Zeroed", value: 1)
!387 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Level", scope: !347, file: !2, baseType: !310, size: 64, align: 64, flags: DIFlagEnumClass, elements: !388)
!388 = !{!350, !351, !352, !353, !354}
!389 = !{!0, !40, !45, !49, !150, !158, !183, !188, !199, !206, !247, !286, !290, !295, !311, !314}
!390 = distinct !DISubprogram(name: "index", linkageName: "_ZN100_$LT$alloc..string..String$u20$as$u20$core..ops..index..Index$LT$core..ops..range..RangeFull$GT$$GT$5index17h12efb1744c60697aE", scope: !392, file: !391, line: 2234, type: !393, scopeLine: 2234, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !4, retainedNodes: !407)
!391 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/alloc/src/string.rs", directory: "", checksumkind: CSK_MD5, checksum: "6e72f4c70a64aa2b17dc14952632c4d9")
!392 = !DINamespace(name: "{impl#28}", scope: !7)
!393 = !DISubroutineType(types: !394)
!394 = !{!120, !5, !395, !398}
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !396, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "1653552c7e3df01a09c3f8c9edf4257")
!396 = !DINamespace(name: "range", scope: !397)
!397 = !DINamespace(name: "ops", scope: !22)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Location", baseType: !399, size: 64, align: 64, dwarfAddressSpace: 0)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !400, file: !2, size: 192, align: 64, elements: !402, templateParams: !4, identifier: "9f9749776572719cc82f4bbe4f5eb8d")
!400 = !DINamespace(name: "location", scope: !401)
!401 = !DINamespace(name: "panic", scope: !22)
!402 = !{!403, !404, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !399, file: !2, baseType: !120, size: 128, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !399, file: !2, baseType: !405, size: 32, align: 32, offset: 128)
!405 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !399, file: !2, baseType: !405, size: 32, align: 32, offset: 160)
!407 = !{!408, !409}
!408 = !DILocalVariable(name: "self", arg: 1, scope: !390, file: !391, line: 2234, type: !5)
!409 = !DILocalVariable(name: "_index", arg: 2, scope: !390, file: !391, line: 2234, type: !395)
!410 = !DILocation(line: 2234, column: 14, scope: !390)
!411 = !DILocation(line: 2234, column: 21, scope: !390)
!412 = !DILocation(line: 2235, column: 43, scope: !390)
!413 = !DILocation(line: 2235, column: 18, scope: !390)
!414 = !DILocation(line: 2236, column: 6, scope: !390)
!415 = distinct !DISubprogram(name: "__iterator_get_unchecked<u8>", linkageName: "_ZN101_$LT$core..slice..iter..ChunksExactMut$LT$T$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$24__iterator_get_unchecked17h207c50f0d1f6190fE", scope: !417, file: !416, line: 1925, type: !420, scopeLine: 1925, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !432)
!416 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "5aaa66a4d49b9ecc9bcb7869337da7d8")
!417 = !DINamespace(name: "{impl#94}", scope: !418)
!418 = !DINamespace(name: "iter", scope: !419)
!419 = !DINamespace(name: "slice", scope: !22)
!420 = !DISubroutineType(types: !421)
!421 = !{!422, !426, !33}
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !423, templateParams: !4, identifier: "7596319ecf86f60af9b48d8c05ebf9f7")
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !422, file: !2, baseType: !25, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !422, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut ChunksExactMut<u8>", baseType: !427, size: 64, align: 64, dwarfAddressSpace: 0)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChunksExactMut<u8>", scope: !418, file: !2, size: 320, align: 64, elements: !428, templateParams: !30, identifier: "e571b1fc82cd9aa7badfb8e1cdfc58bf")
!428 = !{!429, !430, !431}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !427, file: !2, baseType: !422, size: 128, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !427, file: !2, baseType: !422, size: 128, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !427, file: !2, baseType: !33, size: 64, align: 64, offset: 256)
!432 = !{!433, !434, !435}
!433 = !DILocalVariable(name: "self", arg: 1, scope: !415, file: !416, line: 1925, type: !426)
!434 = !DILocalVariable(name: "idx", arg: 2, scope: !415, file: !416, line: 1925, type: !33)
!435 = !DILocalVariable(name: "start", scope: !436, file: !416, line: 1926, type: !33, align: 8)
!436 = distinct !DILexicalBlock(scope: !415, file: !416, line: 1926, column: 9)
!437 = !DILocation(line: 1925, column: 40, scope: !415)
!438 = !DILocation(line: 1925, column: 51, scope: !415)
!439 = !DILocation(line: 1926, column: 27, scope: !415)
!440 = !DILocation(line: 1926, column: 21, scope: !415)
!441 = !DILocation(line: 1926, column: 13, scope: !436)
!442 = !DILocation(line: 1928, column: 37, scope: !436)
!443 = !DILocalVariable(name: "self", arg: 1, scope: !444, file: !445, line: 618, type: !137)
!444 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17h2921b78f08d2ffbeE", scope: !446, file: !445, line: 618, type: !448, scopeLine: 618, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !450)
!445 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "dc9433fa5edb0740532b3ed97e3aaa10")
!446 = !DINamespace(name: "{impl#0}", scope: !447)
!447 = !DINamespace(name: "mut_ptr", scope: !21)
!448 = !DISubroutineType(types: !449)
!449 = !{!137, !137, !33}
!450 = !{!443, !451}
!451 = !DILocalVariable(name: "count", arg: 2, scope: !444, file: !445, line: 618, type: !33)
!452 = !DILocation(line: 618, column: 29, scope: !444, inlinedAt: !453)
!453 = distinct !DILocation(line: 1928, column: 37, scope: !436)
!454 = !DILocation(line: 618, column: 35, scope: !444, inlinedAt: !453)
!455 = !DILocalVariable(name: "self", arg: 1, scope: !456, file: !445, line: 235, type: !137)
!456 = distinct !DISubprogram(name: "offset<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17h83b485e5af09cd76E", scope: !446, file: !445, line: 235, type: !457, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !459)
!457 = !DISubroutineType(types: !458)
!458 = !{!137, !137, !242}
!459 = !{!455, !460}
!460 = !DILocalVariable(name: "count", arg: 2, scope: !456, file: !445, line: 235, type: !242)
!461 = !DILocation(line: 235, column: 32, scope: !456, inlinedAt: !462)
!462 = distinct !DILocation(line: 623, column: 18, scope: !444, inlinedAt: !453)
!463 = !DILocation(line: 235, column: 38, scope: !456, inlinedAt: !462)
!464 = !DILocation(line: 242, column: 18, scope: !456, inlinedAt: !462)
!465 = !DILocation(line: 1928, column: 69, scope: !436)
!466 = !DILocation(line: 1928, column: 18, scope: !436)
!467 = !DILocation(line: 1929, column: 6, scope: !415)
!468 = distinct !DISubprogram(name: "size_hint<u8>", linkageName: "_ZN101_$LT$core..slice..iter..ChunksExactMut$LT$T$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17hcc6e1eec79d3217eE", scope: !417, file: !416, line: 1895, type: !469, scopeLine: 1895, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !486)
!469 = !DISubroutineType(types: !470)
!470 = !{!471, !485}
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, core::option::Option<usize>)", file: !2, size: 192, align: 64, elements: !472, templateParams: !4, identifier: "2c591a652793c3427965aa09ecad855d")
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !471, file: !2, baseType: !33, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !471, file: !2, baseType: !475, size: 128, align: 64, offset: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !172, file: !2, size: 128, align: 64, elements: !476, identifier: "4849786e80860f5416c4c6b259f5a683")
!476 = !{!477}
!477 = !DICompositeType(tag: DW_TAG_variant_part, scope: !172, file: !2, size: 128, align: 64, elements: !478, templateParams: !269, identifier: "4849786e80860f5416c4c6b259f5a683_variant_part", discriminator: !309)
!478 = !{!479, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !477, file: !2, baseType: !480, size: 128, align: 64, extraData: i64 0)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !475, file: !2, size: 128, align: 64, elements: !4, templateParams: !269, identifier: "4849786e80860f5416c4c6b259f5a683::None")
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !477, file: !2, baseType: !482, size: 128, align: 64, extraData: i64 1)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !475, file: !2, size: 128, align: 64, elements: !483, templateParams: !269, identifier: "4849786e80860f5416c4c6b259f5a683::Some")
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !482, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&ChunksExactMut<u8>", baseType: !427, size: 64, align: 64, dwarfAddressSpace: 0)
!486 = !{!487, !488}
!487 = !DILocalVariable(name: "self", arg: 1, scope: !468, file: !416, line: 1895, type: !485)
!488 = !DILocalVariable(name: "n", scope: !489, file: !416, line: 1896, type: !33, align: 8)
!489 = distinct !DILexicalBlock(scope: !468, file: !416, line: 1896, column: 9)
!490 = !DILocation(line: 1895, column: 18, scope: !468)
!491 = !DILocation(line: 1896, column: 17, scope: !468)
!492 = !DILocation(line: 1896, column: 32, scope: !468)
!493 = !DILocation(line: 1896, column: 13, scope: !489)
!494 = !DILocation(line: 1897, column: 13, scope: !489)
!495 = !DILocation(line: 1897, column: 9, scope: !489)
!496 = !{i64 0, i64 2}
!497 = !DILocation(line: 1898, column: 6, scope: !468)
!498 = distinct !DISubprogram(name: "fold<alloc::string::String, core::slice::iter::Iter<&str>, solana_frozen_abi::abi_digester::{impl#2}::update::{closure#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h87f03ed68f78eccaE", scope: !500, file: !499, line: 120, type: !504, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !556, retainedNodes: !552)
!499 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/iter/adapters/map.rs", directory: "", checksumkind: CSK_MD5, checksum: "00602ae7f764e64d630128e594388e5e")
!500 = !DINamespace(name: "{impl#2}", scope: !501)
!501 = !DINamespace(name: "map", scope: !502)
!502 = !DINamespace(name: "adapters", scope: !503)
!503 = !DINamespace(name: "iter", scope: !22)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !506, !157, !530}
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<&str>, solana_frozen_abi::abi_digester::{impl#2}::update::{closure#0}>", scope: !501, file: !2, size: 128, align: 64, elements: !507, templateParams: !527, identifier: "f2c3218f9896a3ef41e5291a8c4e9bcd")
!507 = !{!508, !523}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !506, file: !2, baseType: !509, size: 128, align: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<&str>", scope: !418, file: !2, size: 128, align: 64, elements: !510, templateParams: !516, identifier: "3777ffedd3a0b92589c48390525c0eea")
!510 = !{!511, !518, !519}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !509, file: !2, baseType: !512, size: 64, align: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<&str>", scope: !256, file: !2, size: 64, align: 64, elements: !513, templateParams: !516, identifier: "9bdda3955565479650f1b965e5a7f07f")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !512, file: !2, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !120, size: 64, align: 64, dwarfAddressSpace: 0)
!516 = !{!517}
!517 = !DITemplateTypeParameter(name: "T", type: !120)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !509, file: !2, baseType: !515, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !509, file: !2, baseType: !520, align: 8)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&&str>", scope: !29, file: !2, align: 8, elements: !4, templateParams: !521, identifier: "2312e3a961fce1e229b01cf1faed2e76")
!521 = !{!522}
!522 = !DITemplateTypeParameter(name: "T", type: !119)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !506, file: !2, baseType: !524, align: 8)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !525, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "52e15c79d32990e23254cf584cb8ec0f")
!525 = !DINamespace(name: "update", scope: !526)
!526 = !DINamespace(name: "{impl#2}", scope: !320)
!527 = !{!528, !529}
!528 = !DITemplateTypeParameter(name: "I", type: !509)
!529 = !DITemplateTypeParameter(name: "F", type: !524)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !531, file: !2, size: 192, align: 64, elements: !536, templateParams: !4, identifier: "152d63f8a7670852b3a3d6ae445c64de")
!531 = !DINamespace(name: "call", scope: !532)
!532 = !DINamespace(name: "for_each", scope: !533)
!533 = !DINamespace(name: "Iterator", scope: !534)
!534 = !DINamespace(name: "iterator", scope: !535)
!535 = !DINamespace(name: "traits", scope: !503)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !530, file: !2, baseType: !538, size: 192, align: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !539, file: !2, size: 192, align: 64, elements: !542, templateParams: !4, identifier: "8526ad25426aa878da348b61df9cd594")
!539 = !DINamespace(name: "spec_extend", scope: !540)
!540 = !DINamespace(name: "{impl#1}", scope: !541)
!541 = !DINamespace(name: "spec_extend", scope: !12)
!542 = !{!543, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !538, file: !2, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut String", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "local_len", scope: !538, file: !2, baseType: !546, size: 128, align: 64, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "SetLenOnDrop", scope: !547, file: !2, size: 128, align: 64, elements: !548, templateParams: !4, identifier: "f980d2b206c1f89cdd45daf10e2969")
!547 = !DINamespace(name: "set_len_on_drop", scope: !12)
!548 = !{!549, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !546, file: !2, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut usize", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "local_len", scope: !546, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!552 = !{!553, !554, !555}
!553 = !DILocalVariable(name: "self", arg: 1, scope: !498, file: !499, line: 120, type: !506)
!554 = !DILocalVariable(name: "init", arg: 2, scope: !498, file: !499, line: 120, type: !157)
!555 = !DILocalVariable(name: "g", arg: 3, scope: !498, file: !499, line: 120, type: !530)
!556 = !{!557, !528, !529, !558, !559}
!557 = !DITemplateTypeParameter(name: "B", type: !6)
!558 = !DITemplateTypeParameter(name: "Acc", type: !157)
!559 = !DITemplateTypeParameter(name: "G", type: !530)
!560 = !DILocation(line: 120, column: 21, scope: !498)
!561 = !DILocation(line: 120, column: 27, scope: !498)
!562 = !DILocation(line: 120, column: 38, scope: !498)
!563 = !DILocation(line: 124, column: 47, scope: !498)
!564 = !DILocation(line: 124, column: 30, scope: !498)
!565 = !DILocation(line: 124, column: 9, scope: !498)
!566 = !DILocation(line: 125, column: 6, scope: !498)
!567 = distinct !DISubprogram(name: "try_fold<usize, core::slice::iter::Iter<alloc::string::String>, alloc::str::join_generic_copy::{closure#0}::{closure#0}, usize, fn(usize, usize) -> core::option::Option<usize>, core::option::Option<usize>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$8try_fold17hd31be7faa52a21d0E", scope: !500, file: !499, line: 111, type: !568, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !600, retainedNodes: !596)
!568 = !DISubroutineType(types: !569)
!569 = !{!475, !570, !33, !593}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Map<core::slice::iter::Iter<alloc::string::String>, alloc::str::join_generic_copy::{closure#0}::{closure#0}>", baseType: !571, size: 64, align: 64, dwarfAddressSpace: 0)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<alloc::string::String>, alloc::str::join_generic_copy::{closure#0}::{closure#0}>", scope: !501, file: !2, size: 128, align: 64, elements: !572, templateParams: !590, identifier: "4bca6f233c76b5dd432d35ee13c3ddcc")
!572 = !{!573, !585}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !571, file: !2, baseType: !574, size: 128, align: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<alloc::string::String>", scope: !418, file: !2, size: 128, align: 64, elements: !575, templateParams: !225, identifier: "a30d74439e2c142eb15600e3a353e5a1")
!575 = !{!576, !580, !581}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !574, file: !2, baseType: !577, size: 64, align: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::string::String>", scope: !256, file: !2, size: 64, align: 64, elements: !578, templateParams: !225, identifier: "97cae488ffc081aec4e03be7f92a8b3a")
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !577, file: !2, baseType: !222, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !574, file: !2, baseType: !222, size: 64, align: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !574, file: !2, baseType: !582, align: 8)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&alloc::string::String>", scope: !29, file: !2, align: 8, elements: !4, templateParams: !583, identifier: "9954d650d2f45bb24286f56425ee3204")
!583 = !{!584}
!584 = !DITemplateTypeParameter(name: "T", type: !5)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !571, file: !2, baseType: !586, align: 8)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !587, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "52cee16cfe60389c866998ea970d3817")
!587 = !DINamespace(name: "{closure#0}", scope: !588)
!588 = !DINamespace(name: "join_generic_copy", scope: !589)
!589 = !DINamespace(name: "str", scope: !8)
!590 = !{!591, !592}
!591 = !DITemplateTypeParameter(name: "I", type: !574)
!592 = !DITemplateTypeParameter(name: "F", type: !586)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(usize, usize) -> core::option::Option<usize>", baseType: !594, align: 8, dwarfAddressSpace: 0)
!594 = !DISubroutineType(types: !595)
!595 = !{!475, !33, !33}
!596 = !{!597, !598, !599}
!597 = !DILocalVariable(name: "self", arg: 1, scope: !567, file: !499, line: 111, type: !570)
!598 = !DILocalVariable(name: "init", arg: 2, scope: !567, file: !499, line: 111, type: !33)
!599 = !DILocalVariable(name: "g", arg: 3, scope: !567, file: !499, line: 111, type: !593)
!600 = !{!601, !591, !592, !602, !603, !604}
!601 = !DITemplateTypeParameter(name: "B", type: !33)
!602 = !DITemplateTypeParameter(name: "Acc", type: !33)
!603 = !DITemplateTypeParameter(name: "G", type: !593)
!604 = !DITemplateTypeParameter(name: "R", type: !475)
!605 = !DILocation(line: 111, column: 28, scope: !567)
!606 = !DILocation(line: 111, column: 39, scope: !567)
!607 = !DILocation(line: 111, column: 50, scope: !567)
!608 = !DILocation(line: 117, column: 47, scope: !567)
!609 = !DILocation(line: 117, column: 34, scope: !567)
!610 = !DILocation(line: 117, column: 9, scope: !567)
!611 = !DILocation(line: 118, column: 6, scope: !567)
!612 = distinct !DISubprogram(name: "size_hint<alloc::string::String, core::slice::iter::Iter<&str>, solana_frozen_abi::abi_digester::{impl#2}::update::{closure#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h9368eeee8ed172dbE", scope: !500, file: !499, line: 107, type: !613, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !618, retainedNodes: !616)
!613 = !DISubroutineType(types: !614)
!614 = !{!471, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Map<core::slice::iter::Iter<&str>, solana_frozen_abi::abi_digester::{impl#2}::update::{closure#0}>", baseType: !506, size: 64, align: 64, dwarfAddressSpace: 0)
!616 = !{!617}
!617 = !DILocalVariable(name: "self", arg: 1, scope: !612, file: !499, line: 107, type: !615)
!618 = !{!557, !528, !529}
!619 = !DILocation(line: 107, column: 18, scope: !612)
!620 = !DILocation(line: 108, column: 9, scope: !612)
!621 = !DILocation(line: 109, column: 6, scope: !612)
!622 = distinct !DISubprogram(name: "next<core::slice::iter::ChunksExactMut<u8>, core::slice::iter::Iter<u32>>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h36b6462362c059cdE", scope: !624, file: !623, line: 76, type: !626, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !667, retainedNodes: !670)
!623 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/iter/adapters/zip.rs", directory: "", checksumkind: CSK_MD5, checksum: "f4879531fb05d5b8b226fa4bf4c2f512")
!624 = !DINamespace(name: "{impl#1}", scope: !625)
!625 = !DINamespace(name: "zip", scope: !502)
!626 = !DISubroutineType(types: !627)
!627 = !{!628, !645}
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(&mut [u8], &u32)>", scope: !172, file: !2, size: 192, align: 64, elements: !629, identifier: "9693b085f8745e23426d204494045ded")
!629 = !{!630}
!630 = !DICompositeType(tag: DW_TAG_variant_part, scope: !172, file: !2, size: 192, align: 64, elements: !631, templateParams: !634, identifier: "9693b085f8745e23426d204494045ded_variant_part", discriminator: !309)
!631 = !{!632, !641}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !630, file: !2, baseType: !633, size: 192, align: 64, extraData: i64 0)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !628, file: !2, size: 192, align: 64, elements: !4, templateParams: !634, identifier: "9693b085f8745e23426d204494045ded::None")
!634 = !{!635}
!635 = !DITemplateTypeParameter(name: "T", type: !636)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&mut [u8], &u32)", file: !2, size: 192, align: 64, elements: !637, templateParams: !4, identifier: "69174ddb67290a6641699b89256df0eb")
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !636, file: !2, baseType: !422, size: 128, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !636, file: !2, baseType: !640, size: 64, align: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !405, size: 64, align: 64, dwarfAddressSpace: 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !630, file: !2, baseType: !642, size: 192, align: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !628, file: !2, size: 192, align: 64, elements: !643, templateParams: !634, identifier: "9693b085f8745e23426d204494045ded::Some")
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !642, file: !2, baseType: !636, size: 192, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Zip<core::slice::iter::ChunksExactMut<u8>, core::slice::iter::Iter<u32>>", baseType: !646, size: 64, align: 64, dwarfAddressSpace: 0)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip<core::slice::iter::ChunksExactMut<u8>, core::slice::iter::Iter<u32>>", scope: !625, file: !2, size: 640, align: 64, elements: !647, templateParams: !667, identifier: "7740f65415c9eb15cd66ac6cb7746243")
!647 = !{!648, !649, !664, !665, !666}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !646, file: !2, baseType: !427, size: 320, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !646, file: !2, baseType: !650, size: 128, align: 64, offset: 320)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u32>", scope: !418, file: !2, size: 128, align: 64, elements: !651, templateParams: !657, identifier: "2399f617fc39695640df2cedabeca438")
!651 = !{!652, !659, !660}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !650, file: !2, baseType: !653, size: 64, align: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u32>", scope: !256, file: !2, size: 64, align: 64, elements: !654, templateParams: !657, identifier: "ec5c51d7a5154aa967e8d6aeafb3bfe1")
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !653, file: !2, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u32", baseType: !405, size: 64, align: 64, dwarfAddressSpace: 0)
!657 = !{!658}
!658 = !DITemplateTypeParameter(name: "T", type: !405)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !650, file: !2, baseType: !656, size: 64, align: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !650, file: !2, baseType: !661, align: 8)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u32>", scope: !29, file: !2, align: 8, elements: !4, templateParams: !662, identifier: "1d35292fe7496218cbd0467e0e94625e")
!662 = !{!663}
!663 = !DITemplateTypeParameter(name: "T", type: !640)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !646, file: !2, baseType: !33, size: 64, align: 64, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !646, file: !2, baseType: !33, size: 64, align: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "a_len", scope: !646, file: !2, baseType: !33, size: 64, align: 64, offset: 576)
!667 = !{!668, !669}
!668 = !DITemplateTypeParameter(name: "A", type: !427)
!669 = !DITemplateTypeParameter(name: "B", type: !650)
!670 = !{!671}
!671 = !DILocalVariable(name: "self", arg: 1, scope: !622, file: !623, line: 76, type: !645)
!672 = !DILocation(line: 76, column: 13, scope: !622)
!673 = !DILocation(line: 77, column: 9, scope: !622)
!674 = !DILocation(line: 78, column: 6, scope: !622)
!675 = distinct !DISubprogram(name: "next_back", linkageName: "_ZN102_$LT$core..str..iter..CharIndices$u20$as$u20$core..iter..traits..double_ended..DoubleEndedIterator$GT$9next_back17h972a2e68053b71a4E", scope: !677, file: !676, line: 171, type: !679, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !4, retainedNodes: !719)
!676 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/str/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "f779e00203b15b13d5c175584230dbb4")
!677 = !DINamespace(name: "{impl#6}", scope: !678)
!678 = !DINamespace(name: "iter", scope: !167)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !699}
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, char)>", scope: !172, file: !2, size: 128, align: 64, elements: !682, identifier: "31d4e8368d6edb6eb866d0c699ce3b34")
!682 = !{!683}
!683 = !DICompositeType(tag: DW_TAG_variant_part, scope: !172, file: !2, size: 128, align: 64, elements: !684, templateParams: !687, identifier: "31d4e8368d6edb6eb866d0c699ce3b34_variant_part", discriminator: !698)
!684 = !{!685, !694}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !683, file: !2, baseType: !686, size: 128, align: 64, extraData: i64 1114112)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !681, file: !2, size: 128, align: 64, elements: !4, templateParams: !687, identifier: "31d4e8368d6edb6eb866d0c699ce3b34::None")
!687 = !{!688}
!688 = !DITemplateTypeParameter(name: "T", type: !689)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, char)", file: !2, size: 128, align: 64, elements: !690, templateParams: !4, identifier: "6e1ae05d5199b141d676567142ce0f12")
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !689, file: !2, baseType: !33, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !689, file: !2, baseType: !693, size: 32, align: 32, offset: 64)
!693 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !683, file: !2, baseType: !695, size: 128, align: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !681, file: !2, size: 128, align: 64, elements: !696, templateParams: !687, identifier: "31d4e8368d6edb6eb866d0c699ce3b34::Some")
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !695, file: !2, baseType: !689, size: 128, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, scope: !172, file: !2, baseType: !405, size: 32, align: 32, offset: 64, flags: DIFlagArtificial)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut CharIndices", baseType: !700, size: 64, align: 64, dwarfAddressSpace: 0)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharIndices", scope: !678, file: !2, size: 192, align: 64, elements: !701, templateParams: !4, identifier: "b5243a1c7944575ae3fa63467372053")
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "front_offset", scope: !700, file: !2, baseType: !33, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !700, file: !2, baseType: !704, size: 128, align: 64, offset: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "Chars", scope: !678, file: !2, size: 128, align: 64, elements: !705, templateParams: !4, identifier: "730b184303cd94baa6286550fbfb3ab6")
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !704, file: !2, baseType: !707, size: 128, align: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !418, file: !2, size: 128, align: 64, elements: !708, templateParams: !30, identifier: "d497f50a2820f37aaf72dc233672c27f")
!708 = !{!709, !713, !714}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !707, file: !2, baseType: !710, size: 64, align: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !256, file: !2, size: 64, align: 64, elements: !711, templateParams: !30, identifier: "406fec2678b8bb45d8db3433ccc0ff79")
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !710, file: !2, baseType: !25, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !707, file: !2, baseType: !25, size: 64, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !707, file: !2, baseType: !715, align: 8)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !29, file: !2, align: 8, elements: !4, templateParams: !716, identifier: "5ce1d76292b615ef89d76584ca834d06")
!716 = !{!717}
!717 = !DITemplateTypeParameter(name: "T", type: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!719 = !{!720}
!720 = !DILocalVariable(name: "self", arg: 1, scope: !675, file: !676, line: 171, type: !699)
!721 = !DILocation(line: 171, column: 18, scope: !675)
!722 = !DILocation(line: 172, column: 9, scope: !675)
!723 = !{i32 0, i32 1114113}
!724 = !DILocation(line: 172, column: 35, scope: !675)
!725 = !DILocation(line: 176, column: 6, scope: !675)
!726 = distinct !DISubprogram(name: "{closure#0}", linkageName: "_ZN102_$LT$core..str..iter..CharIndices$u20$as$u20$core..iter..traits..double_ended..DoubleEndedIterator$GT$9next_back28_$u7b$$u7b$closure$u7d$$u7d$17he5dac3227c88a637E", scope: !727, file: !676, line: 172, type: !728, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !4, retainedNodes: !734)
!727 = !DINamespace(name: "next_back", scope: !677)
!728 = !DISubroutineType(types: !729)
!729 = !{!689, !730, !693}
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !727, file: !2, size: 64, align: 64, elements: !731, templateParams: !4, identifier: "110767daeb61ed497a13a716f71fce38")
!731 = !{!732}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self", scope: !730, file: !2, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&mut CharIndices", baseType: !699, size: 64, align: 64, dwarfAddressSpace: 0)
!734 = !{!735, !736, !737}
!735 = !DILocalVariable(name: "ch", arg: 2, scope: !726, file: !676, line: 172, type: !693)
!736 = !DILocalVariable(name: "self", scope: !726, file: !676, line: 171, type: !699, align: 8)
!737 = !DILocalVariable(name: "index", scope: !738, file: !676, line: 173, type: !33, align: 8)
!738 = distinct !DILexicalBlock(scope: !726, file: !676, line: 173, column: 13)
!739 = !DILocation(line: 171, column: 18, scope: !726)
!740 = !DILocation(line: 172, column: 36, scope: !726)
!741 = !DILocation(line: 173, column: 25, scope: !726)
!742 = !DILocation(line: 173, column: 45, scope: !726)
!743 = !DILocalVariable(name: "self", arg: 1, scope: !744, file: !745, line: 119, type: !749)
!744 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN102_$LT$core..slice..iter..Iter$LT$T$GT$$u20$as$u20$core..iter..traits..exact_size..ExactSizeIterator$GT$3len17h00422a291a64dcffE", scope: !746, file: !745, line: 119, type: !747, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !750)
!745 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/slice/iter/macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "eaa73f4306714798d2867dabeabed334")
!746 = !DINamespace(name: "{impl#171}", scope: !418)
!747 = !DISubroutineType(types: !748)
!748 = !{!33, !749}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Iter<u8>", baseType: !707, size: 64, align: 64, dwarfAddressSpace: 0)
!750 = !{!743, !751, !753, !755}
!751 = !DILocalVariable(name: "start", scope: !752, file: !745, line: 120, type: !710, align: 8)
!752 = distinct !DILexicalBlock(scope: !744, file: !745, line: 18, column: 9)
!753 = !DILocalVariable(name: "size", scope: !754, file: !745, line: 120, type: !33, align: 8)
!754 = distinct !DILexicalBlock(scope: !752, file: !745, line: 19, column: 9)
!755 = !DILocalVariable(name: "diff", scope: !756, file: !745, line: 120, type: !33, align: 8)
!756 = distinct !DILexicalBlock(scope: !754, file: !745, line: 29, column: 13)
!757 = !DILocation(line: 119, column: 20, scope: !744, inlinedAt: !758)
!758 = distinct !DILocation(line: 173, column: 45, scope: !726)
!759 = !DILocation(line: 120, column: 17, scope: !744, inlinedAt: !758)
!760 = !DILocation(line: 120, column: 17, scope: !752, inlinedAt: !758)
!761 = !DILocalVariable(arg: 1, scope: !762, file: !416, line: 40, type: !25)
!762 = distinct !DISubprogram(name: "size_from_ptr<u8>", linkageName: "_ZN4core5slice4iter13size_from_ptr17hd7ac37d06df0b6deE", scope: !418, file: !416, line: 40, type: !763, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{!33, !25}
!765 = !{!761}
!766 = !DILocation(line: 40, column: 21, scope: !762, inlinedAt: !767)
!767 = distinct !DILocation(line: 120, column: 17, scope: !752, inlinedAt: !758)
!768 = !DILocation(line: 120, column: 17, scope: !754, inlinedAt: !758)
!769 = !DILocation(line: 120, column: 17, scope: !756, inlinedAt: !758)
!770 = !DILocation(line: 121, column: 14, scope: !744, inlinedAt: !758)
!771 = !DILocation(line: 173, column: 17, scope: !738)
!772 = !DILocation(line: 174, column: 13, scope: !738)
!773 = !DILocation(line: 175, column: 10, scope: !726)
!774 = !{i32 0, i32 1114112}
!775 = distinct !DISubprogram(name: "next_back<core::str::{impl#0}::trim_end::{closure#0}>", linkageName: "_ZN104_$LT$core..str..pattern..MultiCharEqSearcher$LT$C$GT$$u20$as$u20$core..str..pattern..ReverseSearcher$GT$9next_back17h6f71444071f4598aE", scope: !777, file: !776, line: 656, type: !779, scopeLine: 656, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !807, retainedNodes: !809)
!776 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/str/pattern.rs", directory: "", checksumkind: CSK_MD5, checksum: "f063b4c5cc444e408cbabdd16574c029")
!777 = !DINamespace(name: "{impl#8}", scope: !778)
!778 = !DINamespace(name: "pattern", scope: !167)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !798}
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "SearchStep", scope: !778, file: !2, size: 192, align: 64, elements: !782, identifier: "d00ccb443781a236fe5fbe375a73122")
!782 = !{!783}
!783 = !DICompositeType(tag: DW_TAG_variant_part, scope: !778, file: !2, size: 192, align: 64, elements: !784, templateParams: !4, identifier: "d00ccb443781a236fe5fbe375a73122_variant_part", discriminator: !797)
!784 = !{!785, !790, !795}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Match", scope: !783, file: !2, baseType: !786, size: 192, align: 64, extraData: i64 0)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "Match", scope: !781, file: !2, size: 192, align: 64, elements: !787, templateParams: !4, identifier: "d00ccb443781a236fe5fbe375a73122::Match")
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !786, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !786, file: !2, baseType: !33, size: 64, align: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Reject", scope: !783, file: !2, baseType: !791, size: 192, align: 64, extraData: i64 1)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reject", scope: !781, file: !2, size: 192, align: 64, elements: !792, templateParams: !4, identifier: "d00ccb443781a236fe5fbe375a73122::Reject")
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !791, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !791, file: !2, baseType: !33, size: 64, align: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Done", scope: !783, file: !2, baseType: !796, size: 192, align: 64, extraData: i64 2)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "Done", scope: !781, file: !2, size: 192, align: 64, elements: !4, templateParams: !4, identifier: "d00ccb443781a236fe5fbe375a73122::Done")
!797 = !DIDerivedType(tag: DW_TAG_member, scope: !778, file: !2, baseType: !310, size: 64, align: 64, flags: DIFlagArtificial)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut MultiCharEqSearcher<core::str::{impl#0}::trim_end::{closure#0}>", baseType: !799, size: 64, align: 64, dwarfAddressSpace: 0)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiCharEqSearcher<core::str::{impl#0}::trim_end::{closure#0}>", scope: !778, file: !2, size: 320, align: 64, elements: !800, templateParams: !807, identifier: "8b18b63c69a21f5411a1e19877b36d2b")
!800 = !{!801, !805, !806}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "char_eq", scope: !799, file: !2, baseType: !802, align: 8)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !803, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "e1658ad90f1a8e9a7c8505ee955315a9")
!803 = !DINamespace(name: "trim_end", scope: !804)
!804 = !DINamespace(name: "{impl#0}", scope: !167)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "haystack", scope: !799, file: !2, baseType: !120, size: 128, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "char_indices", scope: !799, file: !2, baseType: !700, size: 192, align: 64, offset: 128)
!807 = !{!808}
!808 = !DITemplateTypeParameter(name: "C", type: !802)
!809 = !{!810, !811, !813, !815, !817, !818, !820}
!810 = !DILocalVariable(name: "self", arg: 1, scope: !775, file: !776, line: 656, type: !798)
!811 = !DILocalVariable(name: "s", scope: !812, file: !776, line: 657, type: !699, align: 8)
!812 = distinct !DILexicalBlock(scope: !775, file: !776, line: 657, column: 9)
!813 = !DILocalVariable(name: "pre_len", scope: !814, file: !776, line: 660, type: !33, align: 8)
!814 = distinct !DILexicalBlock(scope: !812, file: !776, line: 660, column: 9)
!815 = !DILocalVariable(name: "i", scope: !816, file: !776, line: 661, type: !33, align: 8)
!816 = distinct !DILexicalBlock(scope: !814, file: !776, line: 661, column: 16)
!817 = !DILocalVariable(name: "c", scope: !816, file: !776, line: 661, type: !693, align: 4)
!818 = !DILocalVariable(name: "len", scope: !819, file: !776, line: 662, type: !33, align: 8)
!819 = distinct !DILexicalBlock(scope: !814, file: !776, line: 662, column: 13)
!820 = !DILocalVariable(name: "char_len", scope: !821, file: !776, line: 663, type: !33, align: 8)
!821 = distinct !DILexicalBlock(scope: !819, file: !776, line: 663, column: 13)
!822 = !DILocation(line: 656, column: 18, scope: !775)
!823 = !DILocation(line: 657, column: 17, scope: !775)
!824 = !DILocation(line: 657, column: 13, scope: !812)
!825 = !DILocation(line: 660, column: 23, scope: !812)
!826 = !DILocation(line: 119, column: 20, scope: !744, inlinedAt: !827)
!827 = distinct !DILocation(line: 660, column: 23, scope: !812)
!828 = !DILocation(line: 120, column: 17, scope: !744, inlinedAt: !827)
!829 = !DILocation(line: 120, column: 17, scope: !752, inlinedAt: !827)
!830 = !DILocation(line: 40, column: 21, scope: !762, inlinedAt: !831)
!831 = distinct !DILocation(line: 120, column: 17, scope: !752, inlinedAt: !827)
!832 = !DILocation(line: 120, column: 17, scope: !754, inlinedAt: !827)
!833 = !DILocation(line: 120, column: 17, scope: !756, inlinedAt: !827)
!834 = !DILocation(line: 121, column: 14, scope: !744, inlinedAt: !827)
!835 = !DILocation(line: 660, column: 13, scope: !814)
!836 = !DILocation(line: 661, column: 31, scope: !814)
!837 = !DILocation(line: 661, column: 16, scope: !814)
!838 = !DILocation(line: 661, column: 22, scope: !814)
!839 = !DILocation(line: 661, column: 22, scope: !816)
!840 = !DILocation(line: 661, column: 25, scope: !814)
!841 = !DILocation(line: 661, column: 25, scope: !816)
!842 = !DILocation(line: 662, column: 23, scope: !814)
!843 = !DILocation(line: 119, column: 20, scope: !744, inlinedAt: !844)
!844 = distinct !DILocation(line: 662, column: 23, scope: !814)
!845 = !DILocation(line: 120, column: 17, scope: !744, inlinedAt: !844)
!846 = !DILocation(line: 120, column: 17, scope: !752, inlinedAt: !844)
!847 = !DILocation(line: 40, column: 21, scope: !762, inlinedAt: !848)
!848 = distinct !DILocation(line: 120, column: 17, scope: !752, inlinedAt: !844)
!849 = !DILocation(line: 120, column: 17, scope: !754, inlinedAt: !844)
!850 = !DILocation(line: 120, column: 17, scope: !756, inlinedAt: !844)
!851 = !DILocation(line: 121, column: 14, scope: !744, inlinedAt: !844)
!852 = !DILocation(line: 662, column: 17, scope: !819)
!853 = !DILocation(line: 670, column: 9, scope: !814)
!854 = !DILocation(line: 671, column: 6, scope: !775)
!855 = !DILocation(line: 663, column: 28, scope: !819)
!856 = !DILocation(line: 663, column: 17, scope: !821)
!857 = !DILocation(line: 664, column: 16, scope: !821)
!858 = !DILocation(line: 667, column: 46, scope: !821)
!859 = !DILocation(line: 667, column: 24, scope: !821)
!860 = !DILocation(line: 667, column: 17, scope: !821)
!861 = !DILocation(line: 665, column: 45, scope: !821)
!862 = !DILocation(line: 665, column: 24, scope: !821)
!863 = !DILocation(line: 665, column: 17, scope: !821)
!864 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$3get17h267ebc9e204d604eE", scope: !866, file: !865, line: 199, type: !868, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !892)
!865 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "a82bc19197b1c05f8386d5b2ec2441bd")
!866 = !DINamespace(name: "{impl#3}", scope: !867)
!867 = !DINamespace(name: "index", scope: !419)
!868 = !DISubroutineType(types: !869)
!869 = !{!870, !886, !878}
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[u8]>", scope: !172, file: !2, size: 128, align: 64, elements: !871, identifier: "ea2e0de53e9549c27c6aed7504a6a6aa")
!871 = !{!872}
!872 = !DICompositeType(tag: DW_TAG_variant_part, scope: !172, file: !2, size: 128, align: 64, elements: !873, templateParams: !876, identifier: "ea2e0de53e9549c27c6aed7504a6a6aa_variant_part", discriminator: !309)
!873 = !{!874, !882}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !872, file: !2, baseType: !875, size: 128, align: 64, extraData: i64 0)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !870, file: !2, size: 128, align: 64, elements: !4, templateParams: !876, identifier: "ea2e0de53e9549c27c6aed7504a6a6aa::None")
!876 = !{!877}
!877 = !DITemplateTypeParameter(name: "T", type: !878)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !879, templateParams: !4, identifier: "585202bcfc7dfd1dd72e8befe2491ee4")
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !878, file: !2, baseType: !25, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !878, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !872, file: !2, baseType: !883, size: 128, align: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !870, file: !2, size: 128, align: 64, elements: !884, templateParams: !876, identifier: "ea2e0de53e9549c27c6aed7504a6a6aa::Some")
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !883, file: !2, baseType: !878, size: 128, align: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !396, file: !2, size: 128, align: 64, elements: !887, templateParams: !890, identifier: "519e5ef7586dbc9eb7e108f1b1bab509")
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !886, file: !2, baseType: !33, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !886, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!890 = !{!891}
!891 = !DITemplateTypeParameter(name: "Idx", type: !33)
!892 = !{!893, !894}
!893 = !DILocalVariable(name: "self", arg: 1, scope: !864, file: !865, line: 199, type: !886)
!894 = !DILocalVariable(name: "slice", arg: 2, scope: !864, file: !865, line: 199, type: !878)
!895 = !DILocation(line: 199, column: 12, scope: !864)
!896 = !DILocation(line: 199, column: 18, scope: !864)
!897 = !DILocation(line: 200, column: 12, scope: !864)
!898 = !DILocation(line: 200, column: 37, scope: !864)
!899 = !{i8 0, i8 2}
!900 = !DILocation(line: 204, column: 29, scope: !864)
!901 = !DILocation(line: 201, column: 13, scope: !864)
!902 = !DILocation(line: 200, column: 9, scope: !864)
!903 = !DILocation(line: 206, column: 6, scope: !864)
!904 = !DILocation(line: 204, column: 22, scope: !864)
!905 = distinct !DISubprogram(name: "next_back<u8>", linkageName: "_ZN106_$LT$core..slice..iter..Iter$LT$T$GT$$u20$as$u20$core..iter..traits..double_ended..DoubleEndedIterator$GT$9next_back17he8e957c89eb50a0aE", scope: !906, file: !745, line: 349, type: !907, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !920)
!906 = !DINamespace(name: "{impl#173}", scope: !418)
!907 = !DISubroutineType(types: !908)
!908 = !{!909, !919}
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&u8>", scope: !172, file: !2, size: 64, align: 64, elements: !910, identifier: "6a688895f599082c77da7ba07346571d")
!910 = !{!911}
!911 = !DICompositeType(tag: DW_TAG_variant_part, scope: !172, file: !2, size: 64, align: 64, elements: !912, templateParams: !716, identifier: "6a688895f599082c77da7ba07346571d_variant_part", discriminator: !309)
!912 = !{!913, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !911, file: !2, baseType: !914, size: 64, align: 64, extraData: i64 0)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !909, file: !2, size: 64, align: 64, elements: !4, templateParams: !716, identifier: "6a688895f599082c77da7ba07346571d::None")
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !911, file: !2, baseType: !916, size: 64, align: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !909, file: !2, size: 64, align: 64, elements: !917, templateParams: !716, identifier: "6a688895f599082c77da7ba07346571d::Some")
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !916, file: !2, baseType: !718, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Iter<u8>", baseType: !707, size: 64, align: 64, dwarfAddressSpace: 0)
!920 = !{!921}
!921 = !DILocalVariable(name: "self", arg: 1, scope: !905, file: !745, line: 349, type: !919)
!922 = !DILocation(line: 349, column: 26, scope: !905)
!923 = !DILocation(line: 357, column: 29, scope: !905)
!924 = !DILocation(line: 357, column: 28, scope: !905)
!925 = !DILocation(line: 357, column: 21, scope: !905)
!926 = !DILocation(line: 358, column: 24, scope: !905)
!927 = !DILocation(line: 358, column: 21, scope: !905)
!928 = !DILocation(line: 359, column: 33, scope: !905)
!929 = !DILocation(line: 359, column: 32, scope: !905)
!930 = !DILocation(line: 359, column: 25, scope: !905)
!931 = !DILocation(line: 361, column: 24, scope: !905)
!932 = !DILocalVariable(name: "self", arg: 1, scope: !933, file: !745, line: 102, type: !919)
!933 = distinct !DISubprogram(name: "pre_dec_end<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$11pre_dec_end17h9df79324ccac8c79E", scope: !707, file: !745, line: 102, type: !934, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{!25, !919, !242}
!936 = !{!932, !937}
!937 = !DILocalVariable(name: "offset", arg: 2, scope: !933, file: !745, line: 102, type: !242)
!938 = !DILocation(line: 102, column: 35, scope: !933, inlinedAt: !939)
!939 = distinct !DILocation(line: 364, column: 30, scope: !905)
!940 = !DILocation(line: 102, column: 46, scope: !933, inlinedAt: !939)
!941 = !DILocation(line: 110, column: 41, scope: !933, inlinedAt: !939)
!942 = !DILocalVariable(name: "self", arg: 1, scope: !943, file: !944, line: 230, type: !25)
!943 = distinct !DISubprogram(name: "offset<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17h91dc454d58ca40e4E", scope: !945, file: !944, line: 230, type: !947, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !30, retainedNodes: !949)
!944 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "d3efc72e5c37c5202bb58c77289e8c38")
!945 = !DINamespace(name: "{impl#0}", scope: !946)
!946 = !DINamespace(name: "const_ptr", scope: !21)
!947 = !DISubroutineType(types: !948)
!948 = !{!25, !25, !242}
!949 = !{!942, !950}
!950 = !DILocalVariable(name: "count", arg: 2, scope: !943, file: !944, line: 230, type: !242)
!951 = !DILocation(line: 230, column: 32, scope: !943, inlinedAt: !952)
!952 = distinct !DILocation(line: 110, column: 41, scope: !933, inlinedAt: !939)
!953 = !DILocation(line: 230, column: 38, scope: !943, inlinedAt: !952)
!954 = !DILocation(line: 235, column: 18, scope: !943, inlinedAt: !952)
!955 = !DILocation(line: 110, column: 21, scope: !933, inlinedAt: !939)
!956 = !DILocation(line: 111, column: 21, scope: !933, inlinedAt: !939)
!957 = !DILocation(line: 113, column: 14, scope: !933, inlinedAt: !939)
!958 = !DILocation(line: 364, column: 30, scope: !905)
!959 = !DILocation(line: 362, column: 25, scope: !905)
!960 = !DILocation(line: 361, column: 21, scope: !905)
!961 = !DILocation(line: 367, column: 14, scope: !905)
!962 = !DILocation(line: 364, column: 25, scope: !905)
!963 = distinct !DISubprogram(name: "next_reject_back<core::str::{impl#0}::trim_end::{closure#0}>", linkageName: "_ZN106_$LT$core..str..pattern..CharPredicateSearcher$LT$F$GT$$u20$as$u20$core..str..pattern..ReverseSearcher$GT$16next_reject_back17h0236297f6420a1f4E", scope: !964, file: !776, line: 749, type: !965, scopeLine: 749, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !987, retainedNodes: !989)
!964 = !DINamespace(name: "{impl#16}", scope: !778)
!965 = !DISubroutineType(types: !966)
!966 = !{!967, !983}
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, usize)>", scope: !172, file: !2, size: 192, align: 64, elements: !968, identifier: "47e68e49d0c13b2e70e20dc7bdc5bb0")
!968 = !{!969}
!969 = !DICompositeType(tag: DW_TAG_variant_part, scope: !172, file: !2, size: 192, align: 64, elements: !970, templateParams: !973, identifier: "47e68e49d0c13b2e70e20dc7bdc5bb0_variant_part", discriminator: !309)
!970 = !{!971, !979}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !969, file: !2, baseType: !972, size: 192, align: 64, extraData: i64 0)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !967, file: !2, size: 192, align: 64, elements: !4, templateParams: !973, identifier: "47e68e49d0c13b2e70e20dc7bdc5bb0::None")
!973 = !{!974}
!974 = !DITemplateTypeParameter(name: "T", type: !975)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, usize)", file: !2, size: 128, align: 64, elements: !976, templateParams: !4, identifier: "692671488c701c539e0f5d11a0760e0")
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !975, file: !2, baseType: !33, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !975, file: !2, baseType: !33, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !969, file: !2, baseType: !980, size: 192, align: 64, extraData: i64 1)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !967, file: !2, size: 192, align: 64, elements: !981, templateParams: !973, identifier: "47e68e49d0c13b2e70e20dc7bdc5bb0::Some")
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !980, file: !2, baseType: !975, size: 128, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut CharPredicateSearcher<core::str::{impl#0}::trim_end::{closure#0}>", baseType: !984, size: 64, align: 64, dwarfAddressSpace: 0)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharPredicateSearcher<core::str::{impl#0}::trim_end::{closure#0}>", scope: !778, file: !2, size: 320, align: 64, elements: !985, templateParams: !987, identifier: "f151b39e35ac98f0e33514e999b4de8d")
!985 = !{!986}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !984, file: !2, baseType: !799, size: 320, align: 64)
!987 = !{!988}
!988 = !DITemplateTypeParameter(name: "F", type: !802)
!989 = !{!990}
!990 = !DILocalVariable(name: "self", arg: 1, scope: !963, file: !776, line: 749, type: !983)
!991 = !DILocation(line: 749, column: 29, scope: !963)
!992 = !DILocation(line: 750, column: 13, scope: !963)
!993 = !DILocation(line: 751, column: 10, scope: !963)
!994 = distinct !DISubprogram(name: "fold<core::str::iter::Chars, solana_frozen_abi::abi_example::normalize_type_name::{closure#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure#0}>", linkageName: "_ZN108_$LT$core..iter..adapters..filter..Filter$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h3692029904f8ffbdE", scope: !996, file: !995, line: 97, type: !998, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !343, templateParams: !1023, retainedNodes: !1019)
!995 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/iter/adapters/filter.rs", directory: "", checksumkind: CSK_MD5, checksum: "efeb22b2b033b9ba1fdf6f3bc5d62d35")
!996 = !DINamespace(name: "{impl#2}", scope: !997)
!997 = !DINamespace(name: "filter", scope: !502)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !1000, !157, !1010}
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "Filter<core::str::iter::Chars, solana_frozen_abi::abi_example::normalize_type_name::{closure#0}>", scope: !997, file: !2, size: 128, align: 64, elements: !1001, templateParams: !1007, identifier: "e9ae49a079cb26b27f00a57e6f7e5ed")
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1000, file: !2, baseType: !704, size: 128, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !1000, file: !2, baseType: !1004, align: 8)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !1005, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "153fbb6659f7219850218b7c3e7af8bc")
!1005 = !DINamespace(name: "normalize_type_name", scope: !1006)
!1006 = !DINamespace(name: "abi_example", scope: !321)
!1007 = !{!1008, !1009}
!1008 = !DITemplateTypeParameter(name: "I", type: !704)
!1009 = !DITemplateTypeParameter(name: "P", type: !1004)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !531, file: !2, size: 64, align: 64, elements: !1011, templateParams: !4, identifier: "3a57ffe2641b3dccc8cece97b20eeccb")
!1011 = !{!1012}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1010, file: !2, baseType: !1013, size: 64, align: 64)
