; ModuleID = 'vending_machine.2059432f-cgu.0'
source_filename = "vending_machine.2059432f-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"anchor_lang::prelude::Pubkey" = type { [32 x i8] }
%"std::vec::IntoIter<u8>" = type { %"std::marker::PhantomData<u8>", %"std::alloc::Global", i8*, i64, i8*, i8* }
%"std::marker::PhantomData<u8>" = type {}
%"std::alloc::Global" = type {}
%"std::option::Option<usize>::Some" = type { [1 x i64], i64 }
%"anchor_lang::idl::IdlAccount" = type { %"std::vec::Vec<u8>", %"anchor_lang::prelude::Pubkey" }
%"std::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"anchor_lang::accounts::program_account::Inner<anchor_lang::idl::IdlAccount>" = type { %"anchor_lang::prelude::AccountInfo", %"anchor_lang::idl::IdlAccount" }
%"anchor_lang::prelude::AccountInfo" = type { %"anchor_lang::prelude::Pubkey"*, i64*, i64*, %"anchor_lang::prelude::Pubkey"*, i64, i8, i8, i8, [5 x i8] }
%"anchor_lang::context::Context<VendingMachine>" = type { %"anchor_lang::prelude::Pubkey"*, %VendingMachine*, { [0 x %"anchor_lang::prelude::AccountInfo"]*, i64 } }
%VendingMachine = type { %"anchor_lang::prelude::Account<Vending>", %"anchor_lang::prelude::Signer", %"anchor_lang::prelude::Program<anchor_lang::System>" }
%"anchor_lang::prelude::Account<Vending>" = type { %Vending, %"anchor_lang::prelude::AccountInfo" }
%Vending = type { %"std::string::String", %"std::string::String", %"std::string::String" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !5, identifier: "vtable")
!4 = !{}
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !6, file: !2, size: 192, align: 64, elements: !8, templateParams: !4, identifier: "e28b11170a43b0ee5a473b5b2ec3c65f")
!6 = !DINamespace(name: "string", scope: !7)
!7 = !DINamespace(name: "alloc", scope: null)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !5, file: !2, baseType: !10, size: 192, align: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !11, file: !2, size: 192, align: 64, elements: !12, templateParams: !36, identifier: "ca400f85b78e93ba5bca8a9ad1767585")
!11 = !DINamespace(name: "vec", scope: !7)
!12 = !{!13, !38}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !10, file: !2, baseType: !14, size: 128, align: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !15, file: !2, size: 128, align: 64, elements: !16, templateParams: !36, identifier: "991210d0a52bfaad42f8b613238cdb8")
!15 = !DINamespace(name: "raw_vec", scope: !7)
!16 = !{!17, !31, !33}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !14, file: !2, baseType: !18, size: 64, align: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !19, file: !2, size: 64, align: 64, elements: !22, templateParams: !29, identifier: "76ad11c5918345b022d81965d637386")
!19 = !DINamespace(name: "unique", scope: !20)
!20 = !DINamespace(name: "ptr", scope: !21)
!21 = !DINamespace(name: "core", scope: null)
!22 = !{!23, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !18, file: !2, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !18, file: !2, baseType: !27, align: 8)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !28, file: !2, align: 8, elements: !4, templateParams: !29, identifier: "d9180f7e28d2761ea11f32bda27bf4b6")
!28 = !DINamespace(name: "marker", scope: !21)
!29 = !{!30}
!30 = !DITemplateTypeParameter(name: "T", type: !25)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !14, file: !2, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !14, file: !2, baseType: !34, align: 8)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !35, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "82a28e8ea0dcac18287e7b3f6b37e370")
!35 = !DINamespace(name: "alloc", scope: !7)
!36 = !{!30, !37}
!37 = !DITemplateTypeParameter(name: "A", type: !34)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !10, file: !2, baseType: !32, size: 64, align: 64, offset: 128)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !42, identifier: "vtable")
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !43, file: !2, size: 128, align: 64, elements: !46, templateParams: !4, identifier: "f761a71e8fab46044eaaa61bad5ad81f")
!43 = !DINamespace(name: "error", scope: !44)
!44 = !DINamespace(name: "io", scope: !45)
!45 = !DINamespace(name: "std", scope: null)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !42, file: !2, baseType: !48, size: 128, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !43, file: !2, size: 128, align: 64, elements: !49, identifier: "21968c09157b928651e5f2d469ad8a26")
!49 = !{!50}
!50 = !DICompositeType(tag: DW_TAG_variant_part, scope: !43, file: !2, size: 128, align: 64, elements: !51, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26_variant_part", discriminator: !139)
!51 = !{!52, !57, !104, !114}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !50, file: !2, baseType: !53, size: 128, align: 64, extraData: i64 0)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !48, file: !2, size: 128, align: 64, elements: !54, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26::Os")
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !53, file: !2, baseType: !56, size: 32, align: 32, offset: 32)
!56 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !50, file: !2, baseType: !58, size: 128, align: 64, extraData: i64 1)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !48, file: !2, size: 128, align: 64, elements: !59, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26::Simple")
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !58, file: !2, baseType: !61, size: 8, align: 8, offset: 8)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !43, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagEnumClass, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!63 = !DIEnumerator(name: "NotFound", value: 0)
!64 = !DIEnumerator(name: "PermissionDenied", value: 1)
!65 = !DIEnumerator(name: "ConnectionRefused", value: 2)
!66 = !DIEnumerator(name: "ConnectionReset", value: 3)
!67 = !DIEnumerator(name: "HostUnreachable", value: 4)
!68 = !DIEnumerator(name: "NetworkUnreachable", value: 5)
!69 = !DIEnumerator(name: "ConnectionAborted", value: 6)
!70 = !DIEnumerator(name: "NotConnected", value: 7)
!71 = !DIEnumerator(name: "AddrInUse", value: 8)
!72 = !DIEnumerator(name: "AddrNotAvailable", value: 9)
!73 = !DIEnumerator(name: "NetworkDown", value: 10)
!74 = !DIEnumerator(name: "BrokenPipe", value: 11)
!75 = !DIEnumerator(name: "AlreadyExists", value: 12)
!76 = !DIEnumerator(name: "WouldBlock", value: 13)
!77 = !DIEnumerator(name: "NotADirectory", value: 14)
!78 = !DIEnumerator(name: "IsADirectory", value: 15)
!79 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16)
!80 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17)
!81 = !DIEnumerator(name: "FilesystemLoop", value: 18)
!82 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19)
!83 = !DIEnumerator(name: "InvalidInput", value: 20)
!84 = !DIEnumerator(name: "InvalidData", value: 21)
!85 = !DIEnumerator(name: "TimedOut", value: 22)
!86 = !DIEnumerator(name: "WriteZero", value: 23)
!87 = !DIEnumerator(name: "StorageFull", value: 24)
!88 = !DIEnumerator(name: "NotSeekable", value: 25)
!89 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26)
!90 = !DIEnumerator(name: "FileTooLarge", value: 27)
!91 = !DIEnumerator(name: "ResourceBusy", value: 28)
!92 = !DIEnumerator(name: "ExecutableFileBusy", value: 29)
!93 = !DIEnumerator(name: "Deadlock", value: 30)
!94 = !DIEnumerator(name: "CrossesDevices", value: 31)
!95 = !DIEnumerator(name: "TooManyLinks", value: 32)
!96 = !DIEnumerator(name: "FilenameTooLong", value: 33)
!97 = !DIEnumerator(name: "ArgumentListTooLong", value: 34)
!98 = !DIEnumerator(name: "Interrupted", value: 35)
!99 = !DIEnumerator(name: "Unsupported", value: 36)
!100 = !DIEnumerator(name: "UnexpectedEof", value: 37)
!101 = !DIEnumerator(name: "OutOfMemory", value: 38)
!102 = !DIEnumerator(name: "Other", value: 39)
!103 = !DIEnumerator(name: "Uncategorized", value: 40)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !50, file: !2, baseType: !105, size: 128, align: 64, extraData: i64 2)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !48, file: !2, size: 128, align: 64, elements: !106, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26::SimpleMessage")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !105, file: !2, baseType: !61, size: 8, align: 8, offset: 8)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !105, file: !2, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !110, size: 64, align: 64, dwarfAddressSpace: 0)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !111, templateParams: !4, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !110, file: !2, baseType: !24, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !110, file: !2, baseType: !32, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !50, file: !2, baseType: !115, size: 128, align: 64, extraData: i64 3)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !48, file: !2, size: 128, align: 64, elements: !116, templateParams: !4, identifier: "21968c09157b928651e5f2d469ad8a26::Custom")
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !115, file: !2, baseType: !118, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !43, file: !2, size: 192, align: 64, elements: !120, templateParams: !4, identifier: "c79edc4407a645b1d40c480671ee721f")
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !119, file: !2, baseType: !61, size: 8, align: 8, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !119, file: !2, baseType: !123, size: 128, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<(dyn std::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", scope: !124, file: !2, size: 128, align: 64, elements: !125, templateParams: !133, identifier: "d02503b268adbc38e1ce7e305a5e4fd")
!124 = !DINamespace(name: "boxed", scope: !7)
!125 = !{!126, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !123, file: !2, baseType: !127, size: 64, align: 64, flags: DIFlagArtificial)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !123, file: !2, baseType: !129, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 192, align: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 3, lowerBound: 0)
!133 = !{!134, !37}
!134 = !DITemplateTypeParameter(name: "T", type: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn std::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !136, templateParams: !4, identifier: "17cf14261d4f40a03288a418a7711d4b")
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !135, file: !2, baseType: !127, size: 64, align: 64, flags: DIFlagArtificial)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !135, file: !2, baseType: !129, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagArtificial)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "ID", linkageName: "_ZN15vending_machine2ID17h68b4ca8f52c78323E", scope: !142, file: !143, line: 6, type: !144, isLocal: false, isDefinition: true, align: 1)
!142 = !DINamespace(name: "vending_machine", scope: null)
!143 = !DIFile(filename: "src/lib.rs", directory: "/workspace", checksumkind: CSK_MD5, checksum: "9f63bbdfcd92c4037c6e36b2bd4afd6c")
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pubkey", scope: !145, file: !2, size: 256, align: 8, elements: !147, templateParams: !4, identifier: "ec71dab31f1fbd2b061f58d8a173c52")
!145 = !DINamespace(name: "pubkey", scope: !146)
!146 = !DINamespace(name: "solana_program", scope: null)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !144, file: !2, baseType: !149, size: 256, align: 8)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, align: 8, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 32, lowerBound: 0)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "A", linkageName: "_ZN15vending_machine1A17hdb061e232f234b78E", scope: !142, file: !154, line: 157, type: !155, isLocal: true, isDefinition: true, align: 8)
!154 = !DIFile(filename: "/root/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-program-1.10.0/src/entrypoint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b907d0d708fd8ca16920cfbc9604cdd9")
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "BumpAllocator", scope: !156, file: !2, size: 128, align: 64, elements: !157, templateParams: !4, identifier: "bec277ed14fcb5ac86e84781934dd476")
!156 = !DINamespace(name: "entrypoint", scope: !146)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !155, file: !2, baseType: !32, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !155, file: !2, baseType: !32, size: 64, align: 64, offset: 64)
!160 = !{i32 7, !"PIC Level", i32 2}
!161 = !{i32 2, !"Debug Info Version", i32 3}
!162 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !163, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, globals: !233)
!163 = !DIFile(filename: "src/lib.rs", directory: "/workspace")
!164 = !{!61, !165, !170, !179, !185}
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !166, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagEnumClass, elements: !167)
!166 = !DINamespace(name: "result", scope: !21)
!167 = !{!168, !169}
!168 = !DIEnumerator(name: "Ok", value: 0)
!169 = !DIEnumerator(name: "Err", value: 1)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !171, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagEnumClass, elements: !174)
!171 = !DINamespace(name: "v1", scope: !172)
!172 = !DINamespace(name: "rt", scope: !173)
!173 = !DINamespace(name: "fmt", scope: !21)
!174 = !{!175, !176, !177, !178}
!175 = !DIEnumerator(name: "Left", value: 0)
!176 = !DIEnumerator(name: "Right", value: 1)
!177 = !DIEnumerator(name: "Center", value: 2)
!178 = !DIEnumerator(name: "Unknown", value: 3)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !180, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagEnumClass, elements: !181)
!180 = !DINamespace(name: "panicking", scope: !21)
!181 = !{!182, !183, !184}
!182 = !DIEnumerator(name: "Eq", value: 0)
!183 = !DIEnumerator(name: "Ne", value: 1)
!184 = !DIEnumerator(name: "Match", value: 2)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorCode", scope: !186, file: !2, baseType: !188, size: 32, align: 32, flags: DIFlagEnumClass, elements: !189)
!186 = !DINamespace(name: "error", scope: !187)
!187 = !DINamespace(name: "anchor_lang", scope: null)
!188 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!190 = !DIEnumerator(name: "InstructionMissing", value: 100, isUnsigned: true)
!191 = !DIEnumerator(name: "InstructionFallbackNotFound", value: 101, isUnsigned: true)
!192 = !DIEnumerator(name: "InstructionDidNotDeserialize", value: 102, isUnsigned: true)
!193 = !DIEnumerator(name: "InstructionDidNotSerialize", value: 103, isUnsigned: true)
!194 = !DIEnumerator(name: "IdlInstructionStub", value: 1000, isUnsigned: true)
!195 = !DIEnumerator(name: "IdlInstructionInvalidProgram", value: 1001, isUnsigned: true)
!196 = !DIEnumerator(name: "ConstraintMut", value: 2000, isUnsigned: true)
!197 = !DIEnumerator(name: "ConstraintHasOne", value: 2001, isUnsigned: true)
!198 = !DIEnumerator(name: "ConstraintSigner", value: 2002, isUnsigned: true)
!199 = !DIEnumerator(name: "ConstraintRaw", value: 2003, isUnsigned: true)
!200 = !DIEnumerator(name: "ConstraintOwner", value: 2004, isUnsigned: true)
!201 = !DIEnumerator(name: "ConstraintRentExempt", value: 2005, isUnsigned: true)
!202 = !DIEnumerator(name: "ConstraintSeeds", value: 2006, isUnsigned: true)
!203 = !DIEnumerator(name: "ConstraintExecutable", value: 2007, isUnsigned: true)
!204 = !DIEnumerator(name: "ConstraintState", value: 2008, isUnsigned: true)
!205 = !DIEnumerator(name: "ConstraintAssociated", value: 2009, isUnsigned: true)
!206 = !DIEnumerator(name: "ConstraintAssociatedInit", value: 2010, isUnsigned: true)
!207 = !DIEnumerator(name: "ConstraintClose", value: 2011, isUnsigned: true)
!208 = !DIEnumerator(name: "ConstraintAddress", value: 2012, isUnsigned: true)
!209 = !DIEnumerator(name: "ConstraintZero", value: 2013, isUnsigned: true)
!210 = !DIEnumerator(name: "ConstraintTokenMint", value: 2014, isUnsigned: true)
!211 = !DIEnumerator(name: "ConstraintTokenOwner", value: 2015, isUnsigned: true)
!212 = !DIEnumerator(name: "ConstraintMintMintAuthority", value: 2016, isUnsigned: true)
!213 = !DIEnumerator(name: "ConstraintMintFreezeAuthority", value: 2017, isUnsigned: true)
!214 = !DIEnumerator(name: "ConstraintMintDecimals", value: 2018, isUnsigned: true)
!215 = !DIEnumerator(name: "ConstraintSpace", value: 2019, isUnsigned: true)
!216 = !DIEnumerator(name: "AccountDiscriminatorAlreadySet", value: 3000, isUnsigned: true)
!217 = !DIEnumerator(name: "AccountDiscriminatorNotFound", value: 3001, isUnsigned: true)
!218 = !DIEnumerator(name: "AccountDiscriminatorMismatch", value: 3002, isUnsigned: true)
!219 = !DIEnumerator(name: "AccountDidNotDeserialize", value: 3003, isUnsigned: true)
!220 = !DIEnumerator(name: "AccountDidNotSerialize", value: 3004, isUnsigned: true)
!221 = !DIEnumerator(name: "AccountNotEnoughKeys", value: 3005, isUnsigned: true)
!222 = !DIEnumerator(name: "AccountNotMutable", value: 3006, isUnsigned: true)
!223 = !DIEnumerator(name: "AccountOwnedByWrongProgram", value: 3007, isUnsigned: true)
!224 = !DIEnumerator(name: "InvalidProgramId", value: 3008, isUnsigned: true)
!225 = !DIEnumerator(name: "InvalidProgramExecutable", value: 3009, isUnsigned: true)
!226 = !DIEnumerator(name: "AccountNotSigner", value: 3010, isUnsigned: true)
!227 = !DIEnumerator(name: "AccountNotSystemOwned", value: 3011, isUnsigned: true)
!228 = !DIEnumerator(name: "AccountNotInitialized", value: 3012, isUnsigned: true)
!229 = !DIEnumerator(name: "AccountNotProgramData", value: 3013, isUnsigned: true)
!230 = !DIEnumerator(name: "AccountNotAssociatedTokenAccount", value: 3014, isUnsigned: true)
!231 = !DIEnumerator(name: "StateInvalidAddress", value: 4000, isUnsigned: true)
!232 = !DIEnumerator(name: "Deprecated", value: 5000, isUnsigned: true)
!233 = !{!0, !39, !140, !152}
!234 = distinct !DISubprogram(name: "size_hint<u8, alloc::alloc::Global>", linkageName: "_ZN103_$LT$alloc..vec..into_iter..IntoIter$LT$T$C$A$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h196d13d64ad0d711E", scope: !236, file: !235, line: 155, type: !238, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !36, retainedNodes: !272)
!235 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/alloc/src/vec/into_iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "9c6848ff2f45a1c252a0fe15a56771c5")
!236 = !DINamespace(name: "{impl#5}", scope: !237)
!237 = !DINamespace(name: "into_iter", scope: !11)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !259}
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, core::option::Option<usize>)", file: !2, size: 192, align: 64, elements: !241, templateParams: !4, identifier: "2c591a652793c3427965aa09ecad855d")
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !240, file: !2, baseType: !32, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !240, file: !2, baseType: !244, size: 128, align: 64, offset: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !245, file: !2, size: 128, align: 64, elements: !246, identifier: "4849786e80860f5416c4c6b259f5a683")
!245 = !DINamespace(name: "option", scope: !21)
!246 = !{!247}
!247 = !DICompositeType(tag: DW_TAG_variant_part, scope: !245, file: !2, size: 128, align: 64, elements: !248, templateParams: !251, identifier: "4849786e80860f5416c4c6b259f5a683_variant_part", discriminator: !257)
!248 = !{!249, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !247, file: !2, baseType: !250, size: 128, align: 64, extraData: i64 0)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !244, file: !2, size: 128, align: 64, elements: !4, templateParams: !251, identifier: "4849786e80860f5416c4c6b259f5a683::None")
!251 = !{!252}
!252 = !DITemplateTypeParameter(name: "T", type: !32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !247, file: !2, baseType: !254, size: 128, align: 64, extraData: i64 1)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !244, file: !2, size: 128, align: 64, elements: !255, templateParams: !251, identifier: "4849786e80860f5416c4c6b259f5a683::Some")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !254, file: !2, baseType: !32, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !2, baseType: !258, size: 64, align: 64, flags: DIFlagArtificial)
!258 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&IntoIter<u8, alloc::alloc::Global>", baseType: !260, size: 64, align: 64, dwarfAddressSpace: 0)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<u8, alloc::alloc::Global>", scope: !237, file: !2, size: 256, align: 64, elements: !261, templateParams: !36, identifier: "df3f961858a09cdbfb8efb636d84526d")
!261 = !{!262, !267, !268, !269, !270, !271}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !260, file: !2, baseType: !263, size: 64, align: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !264, file: !2, size: 64, align: 64, elements: !265, templateParams: !29, identifier: "406fec2678b8bb45d8db3433ccc0ff79")
!264 = !DINamespace(name: "non_null", scope: !20)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !263, file: !2, baseType: !24, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !260, file: !2, baseType: !27, align: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !260, file: !2, baseType: !32, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !260, file: !2, baseType: !34, align: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !260, file: !2, baseType: !24, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !260, file: !2, baseType: !24, size: 64, align: 64, offset: 192)
!272 = !{!273, !274}
!273 = !DILocalVariable(name: "self", arg: 1, scope: !234, file: !235, line: 155, type: !259)
!274 = !DILocalVariable(name: "exact", scope: !275, file: !235, line: 156, type: !32, align: 8)
!275 = distinct !DILexicalBlock(scope: !234, file: !235, line: 156, column: 9)
!276 = !DILocation(line: 155, column: 18, scope: !234)
!277 = !DILocation(line: 156, column: 13, scope: !275)
!278 = !DILocation(line: 156, column: 24, scope: !234)
!279 = !DILocation(line: 157, column: 14, scope: !234)
!280 = !DILocation(line: 157, column: 13, scope: !234)
!281 = !DILocation(line: 157, column: 46, scope: !234)
!282 = !DILocalVariable(name: "self", arg: 1, scope: !283, file: !284, line: 1133, type: !32)
!283 = distinct !DISubprogram(name: "wrapping_sub", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$12wrapping_sub17hcd6164a347ff4cacE", scope: !285, file: !284, line: 1133, type: !287, scopeLine: 1133, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !4, retainedNodes: !289)
!284 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "8bd5648afa999a95525abfd2832ef4ce")
!285 = !DINamespace(name: "{impl#11}", scope: !286)
!286 = !DINamespace(name: "num", scope: !21)
!287 = !DISubroutineType(types: !288)
!288 = !{!32, !32, !32}
!289 = !{!282, !290}
!290 = !DILocalVariable(name: "rhs", arg: 2, scope: !283, file: !284, line: 1133, type: !32)
!291 = !DILocation(line: 1133, column: 35, scope: !283, inlinedAt: !292)
!292 = distinct !DILocation(line: 157, column: 13, scope: !234)
!293 = !DILocation(line: 1133, column: 41, scope: !283, inlinedAt: !292)
!294 = !DILocation(line: 1134, column: 13, scope: !283, inlinedAt: !292)
!295 = !DILocation(line: 159, column: 22, scope: !234)
!296 = !DILocation(line: 159, column: 43, scope: !234)
!297 = !DILocation(line: 156, column: 21, scope: !234)
!298 = !DILocation(line: 161, column: 10, scope: !275)
!299 = !DILocation(line: 161, column: 22, scope: !275)
!300 = !DILocation(line: 161, column: 17, scope: !275)
!301 = !DILocation(line: 161, column: 9, scope: !275)
!302 = !{i64 0, i64 2}
!303 = !DILocation(line: 162, column: 6, scope: !234)
!304 = distinct !DISubprogram(name: "deref_mut<anchor_lang::idl::IdlAccount>", linkageName: "_ZN110_$LT$anchor_lang..accounts..program_account..ProgramAccount$LT$T$GT$$u20$as$u20$core..ops..deref..DerefMut$GT$9deref_mut17hc86cd494916eda8aE", scope: !306, file: !305, line: 171, type: !309, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !415, retainedNodes: !417)
!305 = !DIFile(filename: "/root/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-lang-0.20.1/src/accounts/program_account.rs", directory: "", checksumkind: CSK_MD5, checksum: "4c7e63c74451791e840e3e417ed2ae97")
!306 = !DINamespace(name: "{impl#9}", scope: !307)
!307 = !DINamespace(name: "program_account", scope: !308)
!308 = !DINamespace(name: "accounts", scope: !187)
!309 = !DISubroutineType(types: !310)
!310 = !{!311, !317}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut IdlAccount", baseType: !312, size: 64, align: 64, dwarfAddressSpace: 0)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "IdlAccount", scope: !313, file: !2, size: 448, align: 64, elements: !314, templateParams: !4, identifier: "b5091ef95a3cd9c0b563d8dceef405a8")
!313 = !DINamespace(name: "idl", scope: !187)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !312, file: !2, baseType: !144, size: 256, align: 8, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !2, baseType: !10, size: 192, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut ProgramAccount<anchor_lang::idl::IdlAccount>", baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramAccount<anchor_lang::idl::IdlAccount>", scope: !307, file: !2, size: 64, align: 64, elements: !319, templateParams: !415, identifier: "5a847881e70a88b37599176bb4d3bec3")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !318, file: !2, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<anchor_lang::accounts::program_account::Inner<anchor_lang::idl::IdlAccount>, alloc::alloc::Global>", baseType: !322, size: 64, align: 64, dwarfAddressSpace: 0)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner<anchor_lang::idl::IdlAccount>", scope: !307, file: !2, size: 832, align: 64, elements: !323, templateParams: !415, identifier: "bbb4eb2b2021d5a6c45649928104b183")
!323 = !{!324, !414}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !322, file: !2, baseType: !325, size: 384, align: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountInfo", scope: !326, file: !2, size: 384, align: 64, elements: !327, templateParams: !4, identifier: "8a9d5b531f857f7bd729d38f9fbb8bbd")
!326 = !DINamespace(name: "account_info", scope: !146)
!327 = !{!328, !330, !332, !333, !379, !411, !412, !413}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !325, file: !2, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Pubkey", baseType: !144, size: 64, align: 64, dwarfAddressSpace: 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "is_signer", scope: !325, file: !2, baseType: !331, size: 8, align: 8, offset: 320)
!331 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "is_writable", scope: !325, file: !2, baseType: !331, size: 8, align: 8, offset: 328)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lamports", scope: !325, file: !2, baseType: !334, size: 64, align: 64, offset: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<&mut u64>>", scope: !335, file: !2, size: 64, align: 64, elements: !336, templateParams: !373, identifier: "c8349db45511ec4d5808ecea1e5072a")
!335 = !DINamespace(name: "rc", scope: !7)
!336 = !{!337, !377}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !334, file: !2, baseType: !338, size: 64, align: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", scope: !264, file: !2, size: 64, align: 64, elements: !339, templateParams: !375, identifier: "e89372769d7522ea27e98e37b49a138")
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !338, file: !2, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<&mut u64>>", baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<&mut u64>>", scope: !335, file: !2, size: 256, align: 64, elements: !343, templateParams: !373, identifier: "a72a89d0df443d22eb99fc9f886e2050")
!343 = !{!344, !352, !353}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !342, file: !2, baseType: !345, size: 64, align: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !346, file: !2, size: 64, align: 64, elements: !347, templateParams: !251, identifier: "d610ccc56ed6bc2d95c5846672673907")
!346 = !DINamespace(name: "cell", scope: !21)
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !345, file: !2, baseType: !349, size: 64, align: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !346, file: !2, size: 64, align: 64, elements: !350, templateParams: !251, identifier: "df37019b130d2c01fbc34865afbd6522")
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !349, file: !2, baseType: !32, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !342, file: !2, baseType: !345, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !342, file: !2, baseType: !354, size: 128, align: 64, offset: 128)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<&mut u64>", scope: !346, file: !2, size: 128, align: 64, elements: !355, templateParams: !371, identifier: "7d2673a3f332cc6d0037c3d8efd0c31")
!355 = !{!356, !366}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !354, file: !2, baseType: !357, size: 64, align: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<isize>", scope: !346, file: !2, size: 64, align: 64, elements: !358, templateParams: !364, identifier: "4e95b0f2a1a1d843af31431b8d46a5a9")
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !357, file: !2, baseType: !360, size: 64, align: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<isize>", scope: !346, file: !2, size: 64, align: 64, elements: !361, templateParams: !364, identifier: "a478319df2321c642b07e6e189247bf")
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !360, file: !2, baseType: !363, size: 64, align: 64)
!363 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!364 = !{!365}
!365 = !DITemplateTypeParameter(name: "T", type: !363)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !354, file: !2, baseType: !367, size: 64, align: 64, offset: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<&mut u64>", scope: !346, file: !2, size: 64, align: 64, elements: !368, templateParams: !371, identifier: "fede724123caa5feb7f972fe06520498")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !367, file: !2, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u64", baseType: !258, size: 64, align: 64, dwarfAddressSpace: 0)
!371 = !{!372}
!372 = !DITemplateTypeParameter(name: "T", type: !370)
!373 = !{!374}
!374 = !DITemplateTypeParameter(name: "T", type: !354)
!375 = !{!376}
!376 = !DITemplateTypeParameter(name: "T", type: !342)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !334, file: !2, baseType: !378, align: 8)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", scope: !28, file: !2, align: 8, elements: !4, templateParams: !375, identifier: "e1b7afbeaebb99bbc48d9eab9be04058")
!379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !325, file: !2, baseType: !380, size: 64, align: 64, offset: 128)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<&mut [u8]>>", scope: !335, file: !2, size: 64, align: 64, elements: !381, templateParams: !405, identifier: "78c8daf10b217d77c908ed7a22db99a")
!381 = !{!382, !409}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !380, file: !2, baseType: !383, size: 64, align: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", scope: !264, file: !2, size: 64, align: 64, elements: !384, templateParams: !407, identifier: "e1147ef38e13713c84576547eb35fce1")
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !383, file: !2, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<&mut [u8]>>", baseType: !387, size: 64, align: 64, dwarfAddressSpace: 0)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<&mut [u8]>>", scope: !335, file: !2, size: 320, align: 64, elements: !388, templateParams: !405, identifier: "6e8ee3eba19101dc50a51c81854eb2c")
!388 = !{!389, !390, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !387, file: !2, baseType: !345, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !387, file: !2, baseType: !345, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !387, file: !2, baseType: !392, size: 192, align: 64, offset: 128)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<&mut [u8]>", scope: !346, file: !2, size: 192, align: 64, elements: !393, templateParams: !403, identifier: "7b8d8c983afddbdb1c520939bc6434de")
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !392, file: !2, baseType: !357, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !392, file: !2, baseType: !396, size: 128, align: 64, offset: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<&mut [u8]>", scope: !346, file: !2, size: 128, align: 64, elements: !397, templateParams: !403, identifier: "832d880ad3cb9da2c7f8e74d7eb471dc")
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !396, file: !2, baseType: !399, size: 128, align: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !400, templateParams: !4, identifier: "7596319ecf86f60af9b48d8c05ebf9f7")
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !399, file: !2, baseType: !24, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !399, file: !2, baseType: !32, size: 64, align: 64, offset: 64)
!403 = !{!404}
!404 = !DITemplateTypeParameter(name: "T", type: !399)
!405 = !{!406}
!406 = !DITemplateTypeParameter(name: "T", type: !392)
!407 = !{!408}
!408 = !DITemplateTypeParameter(name: "T", type: !387)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !380, file: !2, baseType: !410, align: 8)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", scope: !28, file: !2, align: 8, elements: !4, templateParams: !407, identifier: "303704ee475681c5f79d405ca05e8ca0")
!411 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !325, file: !2, baseType: !329, size: 64, align: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !325, file: !2, baseType: !331, size: 8, align: 8, offset: 336)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rent_epoch", scope: !325, file: !2, baseType: !258, size: 64, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !322, file: !2, baseType: !312, size: 448, align: 64, offset: 384)
!415 = !{!416}
!416 = !DITemplateTypeParameter(name: "T", type: !312)
!417 = !{!418}
!418 = !DILocalVariable(name: "self", arg: 1, scope: !304, file: !305, line: 171, type: !317)
!419 = !DILocation(line: 171, column: 18, scope: !304)
!420 = !DILocation(line: 178, column: 34, scope: !304)
!421 = !DILocation(line: 178, column: 14, scope: !304)
!422 = !DILocation(line: 178, column: 9, scope: !304)
!423 = !DILocation(line: 179, column: 6, scope: !304)
!424 = distinct !DISubprogram(name: "new<vending_machine::VendingMachine>", linkageName: "_ZN11anchor_lang7context16Context$LT$T$GT$3new17h8724a48eb4dfecf9E", scope: !426, file: !425, line: 45, type: !485, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !483, retainedNodes: !487)
!425 = !DIFile(filename: "/root/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-lang-0.20.1/src/context.rs", directory: "", checksumkind: CSK_MD5, checksum: "1b4626feb0fb03e22fd0d4075291d565")
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context<vending_machine::VendingMachine>", scope: !427, file: !2, size: 256, align: 64, elements: !428, templateParams: !483, identifier: "808fe9aa50fa365244536149d8d4288b")
!427 = !DINamespace(name: "context", scope: !187)
!428 = !{!429, !430, !477}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "program_id", scope: !426, file: !2, baseType: !329, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "accounts", scope: !426, file: !2, baseType: !431, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut VendingMachine", baseType: !432, size: 64, align: 64, dwarfAddressSpace: 0)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "VendingMachine", scope: !142, file: !2, size: 2048, align: 64, elements: !433, templateParams: !4, identifier: "da002b7e58699b8eb86653e1cc2c8194")
!433 = !{!434, !447, !452}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vending", scope: !432, file: !2, baseType: !435, size: 960, align: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Account<vending_machine::Vending>", scope: !436, file: !2, size: 960, align: 64, elements: !437, templateParams: !445, identifier: "47037d6f6c32c5da89df2dcd9d61683e")
!436 = !DINamespace(name: "account", scope: !308)
!437 = !{!438, !444}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !435, file: !2, baseType: !439, size: 576, align: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vending", scope: !142, file: !2, size: 576, align: 64, elements: !440, templateParams: !4, identifier: "f225d976ee3f7173b99e6a868b68259")
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !439, file: !2, baseType: !5, size: 192, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !439, file: !2, baseType: !5, size: 192, align: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !439, file: !2, baseType: !5, size: 192, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !435, file: !2, baseType: !325, size: 384, align: 64, offset: 576)
!445 = !{!446}
!446 = !DITemplateTypeParameter(name: "T", type: !439)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !432, file: !2, baseType: !448, size: 384, align: 64, offset: 960)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signer", scope: !449, file: !2, size: 384, align: 64, elements: !450, templateParams: !4, identifier: "f4ef4560ab07e19a4c2feb8b3a4d613e")
!449 = !DINamespace(name: "signer", scope: !308)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !448, file: !2, baseType: !325, size: 384, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "system_program", scope: !432, file: !2, baseType: !453, size: 704, align: 64, offset: 1344)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Program<anchor_lang::system_program::System>", scope: !454, file: !2, size: 704, align: 64, elements: !455, templateParams: !473, identifier: "4ebde9335da2c6fc93bc2e33d6527a4")
!454 = !DINamespace(name: "program", scope: !308)
!455 = !{!456, !457, !471}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !453, file: !2, baseType: !325, size: 384, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "programdata_address", scope: !453, file: !2, baseType: !458, size: 264, align: 8, offset: 384)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<solana_program::pubkey::Pubkey>", scope: !245, file: !2, size: 264, align: 8, elements: !459, identifier: "32f32615d2877375d5fd32fa8df15554")
!459 = !{!460}
!460 = !DICompositeType(tag: DW_TAG_variant_part, scope: !245, file: !2, size: 264, align: 8, elements: !461, templateParams: !464, identifier: "32f32615d2877375d5fd32fa8df15554_variant_part", discriminator: !470)
!461 = !{!462, !466}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !460, file: !2, baseType: !463, size: 264, align: 8, extraData: i64 0)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !458, file: !2, size: 264, align: 8, elements: !4, templateParams: !464, identifier: "32f32615d2877375d5fd32fa8df15554::None")
!464 = !{!465}
!465 = !DITemplateTypeParameter(name: "T", type: !144)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !460, file: !2, baseType: !467, size: 264, align: 8, extraData: i64 1)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !458, file: !2, size: 264, align: 8, elements: !468, templateParams: !464, identifier: "32f32615d2877375d5fd32fa8df15554::Some")
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !467, file: !2, baseType: !144, size: 256, align: 8, offset: 8)
!470 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagArtificial)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_phantom", scope: !453, file: !2, baseType: !472, align: 8)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<anchor_lang::system_program::System>", scope: !28, file: !2, align: 8, elements: !4, templateParams: !473, identifier: "754821cc834b8cd670e8a748150f2da5")
!473 = !{!474}
!474 = !DITemplateTypeParameter(name: "T", type: !475)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "System", scope: !476, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "3a7958dbf51459373b2cf9b1650119d9")
!476 = !DINamespace(name: "system_program", scope: !187)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_accounts", scope: !426, file: !2, baseType: !478, size: 128, align: 64, offset: 128)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[solana_program::account_info::AccountInfo]", file: !2, size: 128, align: 64, elements: !479, templateParams: !4, identifier: "53f5c7e617784713ffb6e65b7c1a61ea")
!479 = !{!480, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !478, file: !2, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const AccountInfo", baseType: !325, size: 64, align: 64, dwarfAddressSpace: 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !478, file: !2, baseType: !32, size: 64, align: 64, offset: 64)
!483 = !{!484}
!484 = !DITemplateTypeParameter(name: "T", type: !432)
!485 = !DISubroutineType(types: !486)
!486 = !{!426, !329, !431, !478}
!487 = !{!488, !489, !490}
!488 = !DILocalVariable(name: "program_id", arg: 1, scope: !424, file: !425, line: 46, type: !329)
!489 = !DILocalVariable(name: "accounts", arg: 2, scope: !424, file: !425, line: 47, type: !431)
!490 = !DILocalVariable(name: "remaining_accounts", arg: 3, scope: !424, file: !425, line: 48, type: !478)
!491 = !DILocation(line: 46, column: 9, scope: !424)
!492 = !DILocation(line: 47, column: 9, scope: !424)
!493 = !DILocation(line: 48, column: 9, scope: !424)
!494 = !DILocation(line: 50, column: 9, scope: !424)
!495 = !DILocation(line: 55, column: 6, scope: !424)
!496 = distinct !DISubprogram(name: "new<vending_machine::AddDrink>", linkageName: "_ZN11anchor_lang7context16Context$LT$T$GT$3new17hc1a95453e03f99faE", scope: !497, file: !425, line: 45, type: !508, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !506, retainedNodes: !510)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context<vending_machine::AddDrink>", scope: !427, file: !2, size: 256, align: 64, elements: !498, templateParams: !506, identifier: "f446cfd3768e63f1d93b2a96d04b12b7")
!498 = !{!499, !500, !505}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "program_id", scope: !497, file: !2, baseType: !329, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "accounts", scope: !497, file: !2, baseType: !501, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut AddDrink", baseType: !502, size: 64, align: 64, dwarfAddressSpace: 0)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddDrink", scope: !142, file: !2, size: 960, align: 64, elements: !503, templateParams: !4, identifier: "57d49cb9729a1ce51f38269bdce362e")
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "vending", scope: !502, file: !2, baseType: !435, size: 960, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_accounts", scope: !497, file: !2, baseType: !478, size: 128, align: 64, offset: 128)
!506 = !{!507}
!507 = !DITemplateTypeParameter(name: "T", type: !502)
!508 = !DISubroutineType(types: !509)
!509 = !{!497, !329, !501, !478}
!510 = !{!511, !512, !513}
!511 = !DILocalVariable(name: "program_id", arg: 1, scope: !496, file: !425, line: 46, type: !329)
!512 = !DILocalVariable(name: "accounts", arg: 2, scope: !496, file: !425, line: 47, type: !501)
!513 = !DILocalVariable(name: "remaining_accounts", arg: 3, scope: !496, file: !425, line: 48, type: !478)
!514 = !DILocation(line: 46, column: 9, scope: !496)
!515 = !DILocation(line: 47, column: 9, scope: !496)
!516 = !DILocation(line: 48, column: 9, scope: !496)
!517 = !DILocation(line: 50, column: 9, scope: !496)
!518 = !DILocation(line: 55, column: 6, scope: !496)
!519 = distinct !DISubprogram(name: "try_from_unchecked<vending_machine::Vending>", linkageName: "_ZN11anchor_lang8accounts7account16Account$LT$T$GT$18try_from_unchecked17h7a4ed3cb9c18d520E", scope: !435, file: !520, line: 260, type: !521, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !445, retainedNodes: !590)
!520 = !DIFile(filename: "/root/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-lang-0.20.1/src/accounts/account.rs", directory: "", checksumkind: CSK_MD5, checksum: "ef00134a03b36e6718974d4b702dd752")
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !589}
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_lang::accounts::account::Account<vending_machine::Vending>, solana_program::program_error::ProgramError>", scope: !166, file: !2, size: 1024, align: 64, elements: !524, identifier: "10295ea1378ee1e36b8e84f195c440af")
!524 = !{!525}
!525 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !2, size: 1024, align: 64, elements: !526, templateParams: !531, identifier: "10295ea1378ee1e36b8e84f195c440af_variant_part", discriminator: !588)
!526 = !{!527, !584}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !525, file: !2, baseType: !528, size: 1024, align: 64, extraData: i64 0)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !523, file: !2, size: 1024, align: 64, elements: !529, templateParams: !531, identifier: "10295ea1378ee1e36b8e84f195c440af::Ok")
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !528, file: !2, baseType: !435, size: 960, align: 64, offset: 64)
!531 = !{!532, !533}
!532 = !DITemplateTypeParameter(name: "T", type: !435)
!533 = !DITemplateTypeParameter(name: "E", type: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramError", scope: !535, file: !2, size: 256, align: 64, elements: !536, identifier: "13281ff94acf25503a9166813779a484")
!535 = !DINamespace(name: "program_error", scope: !146)
!536 = !{!537}
!537 = !DICompositeType(tag: DW_TAG_variant_part, scope: !535, file: !2, size: 256, align: 64, elements: !538, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484_variant_part", discriminator: !583)
!538 = !{!539, !543, !545, !547, !549, !551, !553, !555, !557, !559, !561, !563, !565, !567, !569, !573, !575, !577, !579, !581}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !537, file: !2, baseType: !540, size: 256, align: 64, extraData: i64 0)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !534, file: !2, size: 256, align: 64, elements: !541, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::Custom")
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !540, file: !2, baseType: !188, size: 32, align: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidArgument", scope: !537, file: !2, baseType: !544, size: 256, align: 64, extraData: i64 1)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidArgument", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::InvalidArgument")
!545 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidInstructionData", scope: !537, file: !2, baseType: !546, size: 256, align: 64, extraData: i64 2)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidInstructionData", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::InvalidInstructionData")
!547 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidAccountData", scope: !537, file: !2, baseType: !548, size: 256, align: 64, extraData: i64 3)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidAccountData", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::InvalidAccountData")
!549 = !DIDerivedType(tag: DW_TAG_member, name: "AccountDataTooSmall", scope: !537, file: !2, baseType: !550, size: 256, align: 64, extraData: i64 4)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountDataTooSmall", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::AccountDataTooSmall")
!551 = !DIDerivedType(tag: DW_TAG_member, name: "InsufficientFunds", scope: !537, file: !2, baseType: !552, size: 256, align: 64, extraData: i64 5)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "InsufficientFunds", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::InsufficientFunds")
!553 = !DIDerivedType(tag: DW_TAG_member, name: "IncorrectProgramId", scope: !537, file: !2, baseType: !554, size: 256, align: 64, extraData: i64 6)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "IncorrectProgramId", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::IncorrectProgramId")
!555 = !DIDerivedType(tag: DW_TAG_member, name: "MissingRequiredSignature", scope: !537, file: !2, baseType: !556, size: 256, align: 64, extraData: i64 7)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "MissingRequiredSignature", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::MissingRequiredSignature")
!557 = !DIDerivedType(tag: DW_TAG_member, name: "AccountAlreadyInitialized", scope: !537, file: !2, baseType: !558, size: 256, align: 64, extraData: i64 8)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountAlreadyInitialized", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::AccountAlreadyInitialized")
!559 = !DIDerivedType(tag: DW_TAG_member, name: "UninitializedAccount", scope: !537, file: !2, baseType: !560, size: 256, align: 64, extraData: i64 9)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "UninitializedAccount", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::UninitializedAccount")
!561 = !DIDerivedType(tag: DW_TAG_member, name: "NotEnoughAccountKeys", scope: !537, file: !2, baseType: !562, size: 256, align: 64, extraData: i64 10)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotEnoughAccountKeys", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::NotEnoughAccountKeys")
!563 = !DIDerivedType(tag: DW_TAG_member, name: "AccountBorrowFailed", scope: !537, file: !2, baseType: !564, size: 256, align: 64, extraData: i64 11)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountBorrowFailed", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::AccountBorrowFailed")
!565 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSeedLengthExceeded", scope: !537, file: !2, baseType: !566, size: 256, align: 64, extraData: i64 12)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaxSeedLengthExceeded", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::MaxSeedLengthExceeded")
!567 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidSeeds", scope: !537, file: !2, baseType: !568, size: 256, align: 64, extraData: i64 13)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidSeeds", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::InvalidSeeds")
!569 = !DIDerivedType(tag: DW_TAG_member, name: "BorshIoError", scope: !537, file: !2, baseType: !570, size: 256, align: 64, extraData: i64 14)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorshIoError", scope: !534, file: !2, size: 256, align: 64, elements: !571, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::BorshIoError")
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !570, file: !2, baseType: !5, size: 192, align: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "AccountNotRentExempt", scope: !537, file: !2, baseType: !574, size: 256, align: 64, extraData: i64 15)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountNotRentExempt", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::AccountNotRentExempt")
!575 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedSysvar", scope: !537, file: !2, baseType: !576, size: 256, align: 64, extraData: i64 16)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsupportedSysvar", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::UnsupportedSysvar")
!577 = !DIDerivedType(tag: DW_TAG_member, name: "IllegalOwner", scope: !537, file: !2, baseType: !578, size: 256, align: 64, extraData: i64 17)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "IllegalOwner", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::IllegalOwner")
!579 = !DIDerivedType(tag: DW_TAG_member, name: "AccountsDataBudgetExceeded", scope: !537, file: !2, baseType: !580, size: 256, align: 64, extraData: i64 18)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountsDataBudgetExceeded", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::AccountsDataBudgetExceeded")
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ActiveVoteAccountClose", scope: !537, file: !2, baseType: !582, size: 256, align: 64, extraData: i64 19)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "ActiveVoteAccountClose", scope: !534, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "13281ff94acf25503a9166813779a484::ActiveVoteAccountClose")
!583 = !DIDerivedType(tag: DW_TAG_member, scope: !535, file: !2, baseType: !188, size: 32, align: 32, flags: DIFlagArtificial)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !525, file: !2, baseType: !585, size: 1024, align: 64, extraData: i64 1)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !523, file: !2, size: 1024, align: 64, elements: !586, templateParams: !531, identifier: "10295ea1378ee1e36b8e84f195c440af::Err")
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !585, file: !2, baseType: !534, size: 256, align: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !2, baseType: !258, size: 64, align: 64, flags: DIFlagArtificial)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&AccountInfo", baseType: !325, size: 64, align: 64, dwarfAddressSpace: 0)
!590 = !{!591, !592, !598, !614, !625, !627}
!591 = !DILocalVariable(name: "info", arg: 1, scope: !519, file: !520, line: 260, type: !589)
!592 = !DILocalVariable(name: "data", scope: !593, file: !520, line: 267, type: !594, align: 8)
!593 = distinct !DILexicalBlock(scope: !519, file: !520, line: 267, column: 9)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !595, templateParams: !4, identifier: "585202bcfc7dfd1dd72e8befe2491ee4")
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !594, file: !2, baseType: !24, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !594, file: !2, baseType: !32, size: 64, align: 64, offset: 64)
!598 = !DILocalVariable(name: "residual", scope: !599, file: !520, line: 267, type: !600, align: 8)
!599 = distinct !DILexicalBlock(scope: !519, file: !520, line: 267, column: 54)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, solana_program::program_error::ProgramError>", scope: !166, file: !2, size: 256, align: 64, elements: !601, identifier: "6b40c91b694c289b4b3e651ec4732ee4")
!601 = !{!602}
!602 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !2, size: 256, align: 64, elements: !603, templateParams: !608, identifier: "6b40c91b694c289b4b3e651ec4732ee4_variant_part")
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !602, file: !2, baseType: !605, size: 256, align: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !600, file: !2, size: 256, align: 64, elements: !606, templateParams: !608, identifier: "6b40c91b694c289b4b3e651ec4732ee4::Err")
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !605, file: !2, baseType: !534, size: 256, align: 64)
!608 = !{!609, !533}
!609 = !DITemplateTypeParameter(name: "T", type: !610)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !611, file: !2, align: 8, elements: !612, identifier: "866eee8446b1bfa4f6d9cf9584e40412")
!611 = !DINamespace(name: "convert", scope: !21)
!612 = !{!613}
!613 = !DICompositeType(tag: DW_TAG_variant_part, scope: !611, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "866eee8446b1bfa4f6d9cf9584e40412_variant_part")
!614 = !DILocalVariable(name: "val", scope: !615, file: !520, line: 267, type: !616, align: 8)
!615 = distinct !DILexicalBlock(scope: !519, file: !520, line: 267, column: 32)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ref<&mut [u8]>", scope: !346, file: !2, size: 128, align: 64, elements: !617, templateParams: !403, identifier: "2f5c33adc0d1e108bf637b0928cbd7d3")
!617 = !{!618, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !616, file: !2, baseType: !619, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&mut [u8]", baseType: !399, size: 64, align: 64, dwarfAddressSpace: 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !616, file: !2, baseType: !621, size: 64, align: 64, offset: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowRef", scope: !346, file: !2, size: 64, align: 64, elements: !622, templateParams: !4, identifier: "b4437e329e4ea0a1b63a71ca0420d36c")
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !621, file: !2, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Cell<isize>", baseType: !357, size: 64, align: 64, dwarfAddressSpace: 0)
!625 = !DILocalVariable(name: "residual", scope: !626, file: !520, line: 270, type: !600, align: 8)
!626 = distinct !DILexicalBlock(scope: !593, file: !520, line: 270, column: 52)
!627 = !DILocalVariable(name: "val", scope: !628, file: !520, line: 270, type: !439, align: 8)
!628 = distinct !DILexicalBlock(scope: !593, file: !520, line: 270, column: 13)
!629 = !DILocation(line: 260, column: 31, scope: !519)
!630 = !DILocation(line: 267, column: 13, scope: !593)
!631 = !DILocation(line: 267, column: 54, scope: !599)
!632 = !DILocation(line: 270, column: 52, scope: !626)
!633 = !DILocation(line: 270, column: 13, scope: !628)
!634 = !DILocation(line: 261, column: 12, scope: !519)
!635 = !DILocation(line: 261, column: 26, scope: !519)
!636 = !DILocation(line: 261, column: 49, scope: !519)
!637 = !{i8 0, i8 2}
!638 = !DILocation(line: 264, column: 12, scope: !519)
!639 = !DILocation(line: 264, column: 27, scope: !519)
!640 = !DILocation(line: 262, column: 24, scope: !519)
!641 = !{i32 100, i32 5001}
!642 = !DILocation(line: 262, column: 20, scope: !519)
!643 = !DILocation(line: 1, column: 1, scope: !644)
!644 = !DILexicalBlockFile(scope: !519, file: !143, discriminator: 0)
!645 = !DILocation(line: 272, column: 6, scope: !519)
!646 = !DILocation(line: 264, column: 26, scope: !519)
!647 = !DILocation(line: 267, column: 32, scope: !519)
!648 = !DILocation(line: 265, column: 24, scope: !519)
!649 = !DILocation(line: 265, column: 20, scope: !519)
!650 = !DILocation(line: 267, column: 32, scope: !615)
!651 = !DILocation(line: 267, column: 31, scope: !519)
!652 = !DILocation(line: 267, column: 54, scope: !519)
!653 = !DILocation(line: 267, column: 32, scope: !599)
!654 = !DILocation(line: 269, column: 13, scope: !593)
!655 = !DILocation(line: 270, column: 13, scope: !593)
!656 = !DILocation(line: 268, column: 12, scope: !593)
!657 = !DILocation(line: 270, column: 52, scope: !593)
!658 = !DILocation(line: 270, column: 13, scope: !626)
!659 = !DILocation(line: 271, column: 9, scope: !593)
!660 = !DILocation(line: 272, column: 5, scope: !519)
!661 = !DILocation(line: 268, column: 9, scope: !593)
!662 = distinct !DISubprogram(name: "new<vending_machine::Vending>", linkageName: "_ZN11anchor_lang8accounts7account16Account$LT$T$GT$3new17ha2dd180aab394249E", scope: !435, file: !520, line: 239, type: !663, scopeLine: 239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !445, retainedNodes: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{!435, !325, !439}
!665 = !{!666, !667}
!666 = !DILocalVariable(name: "info", arg: 1, scope: !662, file: !520, line: 239, type: !325)
!667 = !DILocalVariable(name: "account", arg: 2, scope: !662, file: !520, line: 239, type: !439)
!668 = !DILocation(line: 239, column: 12, scope: !662)
!669 = !DILocation(line: 239, column: 35, scope: !662)
!670 = !DILocation(line: 240, column: 16, scope: !662)
!671 = !DILocation(line: 240, column: 22, scope: !662)
!672 = !DILocation(line: 240, column: 9, scope: !662)
!673 = !DILocation(line: 241, column: 6, scope: !662)
!674 = distinct !DISubprogram(name: "try_from<vending_machine::Vending>", linkageName: "_ZN11anchor_lang8accounts7account16Account$LT$T$GT$8try_from17h2ff5e1ba3730c669E", scope: !435, file: !520, line: 245, type: !521, scopeLine: 245, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !445, retainedNodes: !675)
!675 = !{!676, !677, !679, !681, !683, !685}
!676 = !DILocalVariable(name: "info", arg: 1, scope: !674, file: !520, line: 245, type: !589)
!677 = !DILocalVariable(name: "data", scope: !678, file: !520, line: 252, type: !594, align: 8)
!678 = distinct !DILexicalBlock(scope: !674, file: !520, line: 252, column: 9)
!679 = !DILocalVariable(name: "residual", scope: !680, file: !520, line: 252, type: !600, align: 8)
!680 = distinct !DILexicalBlock(scope: !674, file: !520, line: 252, column: 54)
!681 = !DILocalVariable(name: "val", scope: !682, file: !520, line: 252, type: !616, align: 8)
!682 = distinct !DILexicalBlock(scope: !674, file: !520, line: 252, column: 32)
!683 = !DILocalVariable(name: "residual", scope: !684, file: !520, line: 253, type: !600, align: 8)
!684 = distinct !DILexicalBlock(scope: !678, file: !520, line: 253, column: 68)
!685 = !DILocalVariable(name: "val", scope: !686, file: !520, line: 253, type: !439, align: 8)
!686 = distinct !DILexicalBlock(scope: !678, file: !520, line: 253, column: 39)
!687 = !DILocation(line: 245, column: 21, scope: !674)
!688 = !DILocation(line: 252, column: 13, scope: !678)
!689 = !DILocation(line: 252, column: 54, scope: !680)
!690 = !DILocation(line: 253, column: 68, scope: !684)
!691 = !DILocation(line: 253, column: 39, scope: !686)
!692 = !DILocation(line: 246, column: 12, scope: !674)
!693 = !DILocation(line: 246, column: 26, scope: !674)
!694 = !DILocation(line: 246, column: 49, scope: !674)
!695 = !DILocation(line: 249, column: 12, scope: !674)
!696 = !DILocation(line: 249, column: 27, scope: !674)
!697 = !DILocation(line: 247, column: 24, scope: !674)
!698 = !DILocation(line: 247, column: 20, scope: !674)
!699 = !DILocation(line: 1, column: 1, scope: !700)
!700 = !DILexicalBlockFile(scope: !674, file: !143, discriminator: 0)
!701 = !DILocation(line: 254, column: 6, scope: !674)
!702 = !DILocation(line: 249, column: 26, scope: !674)
!703 = !DILocation(line: 252, column: 32, scope: !674)
!704 = !DILocation(line: 250, column: 24, scope: !674)
!705 = !DILocation(line: 250, column: 20, scope: !674)
!706 = !DILocation(line: 252, column: 32, scope: !682)
!707 = !DILocation(line: 252, column: 31, scope: !674)
!708 = !DILocation(line: 252, column: 54, scope: !674)
!709 = !DILocation(line: 252, column: 32, scope: !680)
!710 = !DILocation(line: 253, column: 25, scope: !678)
!711 = !DILocation(line: 253, column: 39, scope: !678)
!712 = !DILocation(line: 253, column: 12, scope: !678)
!713 = !DILocation(line: 253, column: 68, scope: !678)
!714 = !DILocation(line: 253, column: 39, scope: !684)
!715 = !DILocation(line: 253, column: 69, scope: !678)
!716 = !DILocation(line: 254, column: 5, scope: !674)
!717 = !DILocation(line: 253, column: 9, scope: !678)
!718 = distinct !DISubprogram(name: "new<anchor_lang::system_program::System>", linkageName: "_ZN11anchor_lang8accounts7program16Program$LT$T$GT$3new17h8d28f7e2b4baef25E", scope: !453, file: !719, line: 77, type: !720, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !473, retainedNodes: !722)
!719 = !DIFile(filename: "/root/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-lang-0.20.1/src/accounts/program.rs", directory: "", checksumkind: CSK_MD5, checksum: "8724d6c794834fdc721146c906826600")
!720 = !DISubroutineType(types: !721)
!721 = !{!453, !325, !458}
!722 = !{!723, !724}
!723 = !DILocalVariable(name: "info", arg: 1, scope: !718, file: !719, line: 77, type: !325)
!724 = !DILocalVariable(name: "programdata_address", arg: 2, scope: !718, file: !719, line: 77, type: !458)
!725 = !DILocation(line: 77, column: 12, scope: !718)
!726 = !DILocation(line: 77, column: 35, scope: !718)
!727 = !DILocation(line: 79, column: 13, scope: !718)
!728 = !DILocation(line: 80, column: 13, scope: !718)
!729 = !DILocation(line: 78, column: 9, scope: !718)
!730 = !DILocation(line: 83, column: 6, scope: !718)
!731 = distinct !DISubprogram(name: "try_from<anchor_lang::system_program::System>", linkageName: "_ZN11anchor_lang8accounts7program16Program$LT$T$GT$8try_from17hb863141370d0a0feE", scope: !453, file: !719, line: 87, type: !732, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !473, retainedNodes: !748)
!732 = !DISubroutineType(types: !733)
!733 = !{!734, !589}
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_lang::accounts::program::Program<anchor_lang::system_program::System>, solana_program::program_error::ProgramError>", scope: !166, file: !2, size: 768, align: 64, elements: !735, identifier: "40e0f69b672a54da17e460fb9870ec97")
!735 = !{!736}
!736 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !2, size: 768, align: 64, elements: !737, templateParams: !742, identifier: "40e0f69b672a54da17e460fb9870ec97_variant_part", discriminator: !588)
!737 = !{!738, !744}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !736, file: !2, baseType: !739, size: 768, align: 64, extraData: i64 0)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !734, file: !2, size: 768, align: 64, elements: !740, templateParams: !742, identifier: "40e0f69b672a54da17e460fb9870ec97::Ok")
!740 = !{!741}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !739, file: !2, baseType: !453, size: 704, align: 64, offset: 64)
!742 = !{!743, !533}
!743 = !DITemplateTypeParameter(name: "T", type: !453)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !736, file: !2, baseType: !745, size: 768, align: 64, extraData: i64 1)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !734, file: !2, size: 768, align: 64, elements: !746, templateParams: !742, identifier: "40e0f69b672a54da17e460fb9870ec97::Err")
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !745, file: !2, baseType: !534, size: 256, align: 64, offset: 64)
!748 = !{!749, !750, !752, !754, !756, !758, !781, !783, !785}
!749 = !DILocalVariable(name: "info", arg: 1, scope: !731, file: !719, line: 87, type: !589)
!750 = !DILocalVariable(name: "programdata_address", scope: !751, file: !719, line: 94, type: !458, align: 1)
!751 = distinct !DILexicalBlock(scope: !731, file: !719, line: 94, column: 9)
!752 = !DILocalVariable(name: "data", scope: !753, file: !719, line: 95, type: !594, align: 8)
!753 = distinct !DILexicalBlock(scope: !731, file: !719, line: 95, column: 13)
!754 = !DILocalVariable(name: "residual", scope: !755, file: !719, line: 95, type: !600, align: 8)
!755 = distinct !DILexicalBlock(scope: !731, file: !719, line: 95, column: 58)
!756 = !DILocalVariable(name: "val", scope: !757, file: !719, line: 95, type: !616, align: 8)
!757 = distinct !DILexicalBlock(scope: !731, file: !719, line: 95, column: 36)
!758 = !DILocalVariable(name: "upgradable_loader_state", scope: !759, file: !719, line: 96, type: !760, align: 8)
!759 = distinct !DILexicalBlock(scope: !753, file: !719, line: 96, column: 13)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "UpgradeableLoaderState", scope: !761, file: !2, size: 384, align: 64, elements: !762, identifier: "b9f0615ad3750b3220be4f45b8ee8c2f")
!761 = !DINamespace(name: "bpf_loader_upgradeable", scope: !146)
!762 = !{!763}
!763 = !DICompositeType(tag: DW_TAG_variant_part, scope: !761, file: !2, size: 384, align: 64, elements: !764, templateParams: !4, identifier: "b9f0615ad3750b3220be4f45b8ee8c2f_variant_part", discriminator: !780)
!764 = !{!765, !767, !771, !775}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Uninitialized", scope: !763, file: !2, baseType: !766, size: 384, align: 64, extraData: i64 0)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "Uninitialized", scope: !760, file: !2, size: 384, align: 64, elements: !4, templateParams: !4, identifier: "b9f0615ad3750b3220be4f45b8ee8c2f::Uninitialized")
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !763, file: !2, baseType: !768, size: 384, align: 64, extraData: i64 1)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !760, file: !2, size: 384, align: 64, elements: !769, templateParams: !4, identifier: "b9f0615ad3750b3220be4f45b8ee8c2f::Buffer")
!769 = !{!770}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "authority_address", scope: !768, file: !2, baseType: !458, size: 264, align: 8, offset: 8)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Program", scope: !763, file: !2, baseType: !772, size: 384, align: 64, extraData: i64 2)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Program", scope: !760, file: !2, size: 384, align: 64, elements: !773, templateParams: !4, identifier: "b9f0615ad3750b3220be4f45b8ee8c2f::Program")
!773 = !{!774}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "programdata_address", scope: !772, file: !2, baseType: !144, size: 256, align: 8, offset: 8)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ProgramData", scope: !763, file: !2, baseType: !776, size: 384, align: 64, extraData: i64 3)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramData", scope: !760, file: !2, size: 384, align: 64, elements: !777, templateParams: !4, identifier: "b9f0615ad3750b3220be4f45b8ee8c2f::ProgramData")
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !776, file: !2, baseType: !258, size: 64, align: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade_authority_address", scope: !776, file: !2, baseType: !458, size: 264, align: 8, offset: 8)
!780 = !DIDerivedType(tag: DW_TAG_member, scope: !761, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagArtificial)
!781 = !DILocalVariable(name: "residual", scope: !782, file: !719, line: 97, type: !600, align: 8)
!782 = distinct !DILexicalBlock(scope: !753, file: !719, line: 97, column: 77)
!783 = !DILocalVariable(name: "val", scope: !784, file: !719, line: 97, type: !760, align: 8)
!784 = distinct !DILexicalBlock(scope: !753, file: !719, line: 97, column: 17)
!785 = !DILocalVariable(name: "programdata_address", scope: !786, file: !719, line: 114, type: !144, align: 1)
!786 = distinct !DILexicalBlock(scope: !759, file: !719, line: 113, column: 17)
!787 = !DILocation(line: 87, column: 21, scope: !731)
!788 = !DILocation(line: 94, column: 13, scope: !751)
!789 = !DILocation(line: 95, column: 17, scope: !753)
!790 = !DILocation(line: 95, column: 58, scope: !755)
!791 = !DILocation(line: 96, column: 17, scope: !759)
!792 = !DILocation(line: 97, column: 77, scope: !782)
!793 = !DILocation(line: 97, column: 17, scope: !784)
!794 = !DILocation(line: 114, column: 21, scope: !786)
!795 = !DILocation(line: 88, column: 12, scope: !731)
!796 = !DILocation(line: 88, column: 25, scope: !731)
!797 = !DILocation(line: 88, column: 24, scope: !731)
!798 = !DILocation(line: 91, column: 13, scope: !731)
!799 = !DILocation(line: 91, column: 12, scope: !731)
!800 = !DILocation(line: 89, column: 24, scope: !731)
!801 = !DILocation(line: 89, column: 20, scope: !731)
!802 = !DILocation(line: 1, column: 1, scope: !803)
!803 = !DILexicalBlockFile(scope: !731, file: !143, discriminator: 0)
!804 = !DILocation(line: 122, column: 6, scope: !731)
!805 = !DILocation(line: 94, column: 38, scope: !731)
!806 = !DILocation(line: 92, column: 24, scope: !731)
!807 = !DILocation(line: 92, column: 20, scope: !731)
!808 = !DILocation(line: 118, column: 13, scope: !731)
!809 = !DILocation(line: 94, column: 35, scope: !731)
!810 = !DILocation(line: 95, column: 36, scope: !731)
!811 = !DILocation(line: 95, column: 36, scope: !757)
!812 = !DILocation(line: 95, column: 35, scope: !731)
!813 = !DILocation(line: 95, column: 58, scope: !731)
!814 = !DILocation(line: 95, column: 36, scope: !755)
!815 = !DILocation(line: 97, column: 17, scope: !753)
!816 = !DILocation(line: 99, column: 19, scope: !759)
!817 = !{i8 0, i8 4}
!818 = !DILocation(line: 99, column: 13, scope: !759)
!819 = !DILocation(line: 97, column: 77, scope: !753)
!820 = !DILocation(line: 97, column: 17, scope: !782)
!821 = !DILocation(line: 117, column: 9, scope: !731)
!822 = !DILocation(line: 111, column: 21, scope: !759)
!823 = !DILocation(line: 114, column: 21, scope: !759)
!824 = !DILocation(line: 115, column: 27, scope: !786)
!825 = !DILocation(line: 115, column: 22, scope: !786)
!826 = !DILocation(line: 121, column: 25, scope: !751)
!827 = !DILocation(line: 121, column: 39, scope: !751)
!828 = !DILocation(line: 121, column: 12, scope: !751)
!829 = !DILocation(line: 121, column: 9, scope: !751)
!830 = distinct !DISubprogram(name: "spec_extend<u8, alloc::alloc::Global>", linkageName: "_ZN136_$LT$alloc..vec..Vec$LT$T$C$A$GT$$u20$as$u20$alloc..vec..spec_extend..SpecExtend$LT$T$C$alloc..vec..into_iter..IntoIter$LT$T$GT$$GT$$GT$11spec_extend17h8b66b323c80809b1E", scope: !832, file: !831, line: 61, type: !834, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !36, retainedNodes: !837)
!831 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/alloc/src/vec/spec_extend.rs", directory: "", checksumkind: CSK_MD5, checksum: "84dcaee8455004b919775423d785cbec")
!832 = !DINamespace(name: "{impl#2}", scope: !833)
!833 = !DINamespace(name: "spec_extend", scope: !11)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !836, !260}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Vec<u8, alloc::alloc::Global>", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!837 = !{!838, !839}
!838 = !DILocalVariable(name: "self", arg: 1, scope: !830, file: !831, line: 61, type: !836)
!839 = !DILocalVariable(name: "iterator", arg: 2, scope: !830, file: !831, line: 61, type: !260)
!840 = !DILocation(line: 61, column: 20, scope: !830)
!841 = !DILocation(line: 61, column: 31, scope: !830)
!842 = !DILocation(line: 63, column: 34, scope: !830)
!843 = !DILocation(line: 63, column: 13, scope: !830)
!844 = !DILocation(line: 65, column: 24, scope: !830)
!845 = !DILocation(line: 65, column: 9, scope: !830)
!846 = !DILocation(line: 66, column: 5, scope: !830)
!847 = !DILocation(line: 66, column: 6, scope: !830)
!848 = distinct !DISubprogram(name: "sol_log", linkageName: "_ZN14solana_program3log7sol_log17h9074fff3cfaa086dE", scope: !850, file: !849, line: 42, type: !851, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !4, retainedNodes: !853)
!849 = !DIFile(filename: "/root/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-program-1.10.0/src/log.rs", directory: "", checksumkind: CSK_MD5, checksum: "f068dd30b1b933bfce901049b88ca975")
!850 = !DINamespace(name: "log", scope: !146)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !110}
!853 = !{!854}
!854 = !DILocalVariable(name: "message", arg: 1, scope: !848, file: !849, line: 42, type: !110)
!855 = !DILocation(line: 42, column: 16, scope: !848)
!856 = !DILocation(line: 45, column: 18, scope: !848)
!857 = !DILocation(line: 45, column: 36, scope: !848)
!858 = !DILocation(line: 45, column: 9, scope: !848)
!859 = !DILocation(line: 50, column: 2, scope: !848)
!860 = distinct !DISubprogram(name: "from_residual<vending_machine::AddDrink, solana_program::program_error::ProgramError, solana_program::program_error::ProgramError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h0a8c4454c55c0fc2E", scope: !862, file: !861, line: 1913, type: !863, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !882, retainedNodes: !878)
!861 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "f73030f150a3926f0f5a346ed13cef73")
!862 = !DINamespace(name: "{impl#37}", scope: !166)
!863 = !DISubroutineType(types: !864)
!864 = !{!865, !600}
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<vending_machine::AddDrink, solana_program::program_error::ProgramError>", scope: !166, file: !2, size: 1024, align: 64, elements: !866, identifier: "52d86612110066c885d9759b362e56ed")
!866 = !{!867}
!867 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !2, size: 1024, align: 64, elements: !868, templateParams: !873, identifier: "52d86612110066c885d9759b362e56ed_variant_part", discriminator: !588)
!868 = !{!869, !874}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !867, file: !2, baseType: !870, size: 1024, align: 64, extraData: i64 0)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !865, file: !2, size: 1024, align: 64, elements: !871, templateParams: !873, identifier: "52d86612110066c885d9759b362e56ed::Ok")
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !870, file: !2, baseType: !502, size: 960, align: 64, offset: 64)
!873 = !{!507, !533}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !867, file: !2, baseType: !875, size: 1024, align: 64, extraData: i64 1)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !865, file: !2, size: 1024, align: 64, elements: !876, templateParams: !873, identifier: "52d86612110066c885d9759b362e56ed::Err")
!876 = !{!877}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !875, file: !2, baseType: !534, size: 256, align: 64, offset: 64)
!878 = !{!879, !880}
!879 = !DILocalVariable(name: "residual", arg: 1, scope: !860, file: !861, line: 1913, type: !600)
!880 = !DILocalVariable(name: "e", scope: !881, file: !861, line: 1915, type: !534, align: 8)
!881 = distinct !DILexicalBlock(scope: !860, file: !861, line: 1915, column: 13)
!882 = !{!507, !533, !883}
!883 = !DITemplateTypeParameter(name: "F", type: !534)
!884 = !DILocation(line: 1913, column: 22, scope: !860)
!885 = !DILocation(line: 1915, column: 17, scope: !881)
!886 = !DILocation(line: 1915, column: 17, scope: !860)
!887 = !DILocation(line: 1915, column: 38, scope: !881)
!888 = !DILocation(line: 1915, column: 27, scope: !881)
!889 = !DILocation(line: 1915, column: 23, scope: !881)
!890 = !DILocation(line: 1917, column: 6, scope: !860)
!891 = distinct !DISubprogram(name: "from_residual<vending_machine::VendingMachine, solana_program::program_error::ProgramError, solana_program::program_error::ProgramError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h380e3976a0d94ea1E", scope: !862, file: !861, line: 1913, type: !892, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !911, retainedNodes: !907)
!892 = !DISubroutineType(types: !893)
!893 = !{!894, !600}
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<vending_machine::VendingMachine, solana_program::program_error::ProgramError>", scope: !166, file: !2, size: 2112, align: 64, elements: !895, identifier: "6d1e1fdb3efb8985eb2df3de54eae767")
!895 = !{!896}
!896 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !2, size: 2112, align: 64, elements: !897, templateParams: !902, identifier: "6d1e1fdb3efb8985eb2df3de54eae767_variant_part", discriminator: !588)
!897 = !{!898, !903}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !896, file: !2, baseType: !899, size: 2112, align: 64, extraData: i64 0)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !894, file: !2, size: 2112, align: 64, elements: !900, templateParams: !902, identifier: "6d1e1fdb3efb8985eb2df3de54eae767::Ok")
!900 = !{!901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !899, file: !2, baseType: !432, size: 2048, align: 64, offset: 64)
!902 = !{!484, !533}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !896, file: !2, baseType: !904, size: 2112, align: 64, extraData: i64 1)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !894, file: !2, size: 2112, align: 64, elements: !905, templateParams: !902, identifier: "6d1e1fdb3efb8985eb2df3de54eae767::Err")
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !904, file: !2, baseType: !534, size: 256, align: 64, offset: 64)
!907 = !{!908, !909}
!908 = !DILocalVariable(name: "residual", arg: 1, scope: !891, file: !861, line: 1913, type: !600)
!909 = !DILocalVariable(name: "e", scope: !910, file: !861, line: 1915, type: !534, align: 8)
!910 = distinct !DILexicalBlock(scope: !891, file: !861, line: 1915, column: 13)
!911 = !{!484, !533, !883}
!912 = !DILocation(line: 1913, column: 22, scope: !891)
!913 = !DILocation(line: 1915, column: 17, scope: !910)
!914 = !DILocation(line: 1915, column: 17, scope: !891)
!915 = !DILocation(line: 1915, column: 38, scope: !910)
!916 = !DILocation(line: 1915, column: 27, scope: !910)
!917 = !DILocation(line: 1915, column: 23, scope: !910)
!918 = !DILocation(line: 1917, column: 6, scope: !891)
!919 = distinct !DISubprogram(name: "from_residual<vending_machine::instruction::AddDrink, std::io::error::Error, std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h6335b311cfc6920dE", scope: !862, file: !861, line: 1913, type: !920, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !956, retainedNodes: !952)
!920 = !DISubroutineType(types: !921)
!921 = !{!922, !943}
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<vending_machine::instruction::AddDrink, std::io::error::Error>", scope: !166, file: !2, size: 640, align: 64, elements: !923, identifier: "b989daaf19d4473cf3276e93468e7d9f")
!923 = !{!924}
!924 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !2, size: 640, align: 64, elements: !925, templateParams: !936, identifier: "b989daaf19d4473cf3276e93468e7d9f_variant_part", discriminator: !588)
!925 = !{!926, !939}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !924, file: !2, baseType: !927, size: 640, align: 64, extraData: i64 0)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !922, file: !2, size: 640, align: 64, elements: !928, templateParams: !936, identifier: "b989daaf19d4473cf3276e93468e7d9f::Ok")
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !927, file: !2, baseType: !930, size: 576, align: 64, offset: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddDrink", scope: !931, file: !2, size: 576, align: 64, elements: !932, templateParams: !4, identifier: "952acaf949547666e53c41f143c98188")
!931 = !DINamespace(name: "instruction", scope: !142)
!932 = !{!933, !934, !935}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !930, file: !2, baseType: !5, size: 192, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !930, file: !2, baseType: !5, size: 192, align: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !930, file: !2, baseType: !5, size: 192, align: 64, offset: 384)
!936 = !{!937, !938}
!937 = !DITemplateTypeParameter(name: "T", type: !930)
!938 = !DITemplateTypeParameter(name: "E", type: !42)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !924, file: !2, baseType: !940, size: 640, align: 64, extraData: i64 1)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !922, file: !2, size: 640, align: 64, elements: !941, templateParams: !936, identifier: "b989daaf19d4473cf3276e93468e7d9f::Err")
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !940, file: !2, baseType: !42, size: 128, align: 64, offset: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, std::io::error::Error>", scope: !166, file: !2, size: 128, align: 64, elements: !944, identifier: "c1b899c3e09f8df8d1c7dfa8c045a2c1")
!944 = !{!945}
!945 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !2, size: 128, align: 64, elements: !946, templateParams: !951, identifier: "c1b899c3e09f8df8d1c7dfa8c045a2c1_variant_part")
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !945, file: !2, baseType: !948, size: 128, align: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !943, file: !2, size: 128, align: 64, elements: !949, templateParams: !951, identifier: "c1b899c3e09f8df8d1c7dfa8c045a2c1::Err")
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !948, file: !2, baseType: !42, size: 128, align: 64)
!951 = !{!609, !938}
!952 = !{!953, !954}
!953 = !DILocalVariable(name: "residual", arg: 1, scope: !919, file: !861, line: 1913, type: !943)
!954 = !DILocalVariable(name: "e", scope: !955, file: !861, line: 1915, type: !42, align: 8)
!955 = distinct !DILexicalBlock(scope: !919, file: !861, line: 1915, column: 13)
!956 = !{!937, !938, !957}
!957 = !DITemplateTypeParameter(name: "F", type: !42)
!958 = !DILocation(line: 1913, column: 22, scope: !919)
!959 = !DILocation(line: 1915, column: 17, scope: !955)
!960 = !DILocation(line: 1915, column: 17, scope: !919)
!961 = !DILocation(line: 1915, column: 38, scope: !955)
!962 = !DILocation(line: 1915, column: 27, scope: !955)
!963 = !DILocation(line: 1915, column: 23, scope: !955)
!964 = !DILocation(line: 1917, column: 6, scope: !919)
!965 = distinct !DISubprogram(name: "from_residual<anchor_lang::accounts::program::Program<anchor_lang::system_program::System>, solana_program::program_error::ProgramError, solana_program::program_error::ProgramError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h839ea806fbdd34cdE", scope: !862, file: !861, line: 1913, type: !966, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !972, retainedNodes: !968)
!966 = !DISubroutineType(types: !967)
!967 = !{!734, !600}
!968 = !{!969, !970}
!969 = !DILocalVariable(name: "residual", arg: 1, scope: !965, file: !861, line: 1913, type: !600)
!970 = !DILocalVariable(name: "e", scope: !971, file: !861, line: 1915, type: !534, align: 8)
!971 = distinct !DILexicalBlock(scope: !965, file: !861, line: 1915, column: 13)
!972 = !{!743, !533, !883}
!973 = !DILocation(line: 1913, column: 22, scope: !965)
!974 = !DILocation(line: 1915, column: 17, scope: !971)
!975 = !DILocation(line: 1915, column: 17, scope: !965)
!976 = !DILocation(line: 1915, column: 38, scope: !971)
!977 = !DILocation(line: 1915, column: 27, scope: !971)
!978 = !DILocation(line: 1915, column: 23, scope: !971)
!979 = !DILocation(line: 1917, column: 6, scope: !965)
!980 = distinct !DISubprogram(name: "from_residual<vending_machine::Vending, std::io::error::Error, std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h8f4f10f9357a8b81E", scope: !862, file: !861, line: 1913, type: !981, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !1000, retainedNodes: !996)
!981 = !DISubroutineType(types: !982)
!982 = !{!983, !943}
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<vending_machine::Vending, std::io::error::Error>", scope: !166, file: !2, size: 640, align: 64, elements: !984, identifier: "cf9759445a1584d22543c2b1eca41902")
!984 = !{!985}
!985 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !2, size: 640, align: 64, elements: !986, templateParams: !991, identifier: "cf9759445a1584d22543c2b1eca41902_variant_part", discriminator: !588)
!986 = !{!987, !992}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !985, file: !2, baseType: !988, size: 640, align: 64, extraData: i64 0)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !983, file: !2, size: 640, align: 64, elements: !989, templateParams: !991, identifier: "cf9759445a1584d22543c2b1eca41902::Ok")
!989 = !{!990}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !988, file: !2, baseType: !439, size: 576, align: 64, offset: 64)
!991 = !{!446, !938}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !985, file: !2, baseType: !993, size: 640, align: 64, extraData: i64 1)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !983, file: !2, size: 640, align: 64, elements: !994, templateParams: !991, identifier: "cf9759445a1584d22543c2b1eca41902::Err")
!994 = !{!995}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !993, file: !2, baseType: !42, size: 128, align: 64, offset: 64)
!996 = !{!997, !998}
!997 = !DILocalVariable(name: "residual", arg: 1, scope: !980, file: !861, line: 1913, type: !943)
!998 = !DILocalVariable(name: "e", scope: !999, file: !861, line: 1915, type: !42, align: 8)
!999 = distinct !DILexicalBlock(scope: !980, file: !861, line: 1915, column: 13)
!1000 = !{!446, !938, !957}
!1001 = !DILocation(line: 1913, column: 22, scope: !980)
!1002 = !DILocation(line: 1915, column: 17, scope: !999)
!1003 = !DILocation(line: 1915, column: 17, scope: !980)
!1004 = !DILocation(line: 1915, column: 38, scope: !999)
!1005 = !DILocation(line: 1915, column: 27, scope: !999)
!1006 = !DILocation(line: 1915, column: 23, scope: !999)
!1007 = !DILocation(line: 1917, column: 6, scope: !980)
!1008 = distinct !DISubprogram(name: "from_residual<anchor_lang::accounts::account::Account<vending_machine::Vending>, solana_program::program_error::ProgramError, solana_program::program_error::ProgramError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hbc6a978433ef2318E", scope: !862, file: !861, line: 1913, type: !1009, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, templateParams: !1015, retainedNodes: !1011)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!523, !600}
!1011 = !{!1012, !1013}
!1012 = !DILocalVariable(name: "residual", arg: 1, scope: !1008, file: !861, line: 1913, type: !600)
!1013 = !DILocalVariable(name: "e", scope: !1014, file: !861, line: 1915, type: !534, align: 8)
!1014 = distinct !DILexicalBlock(scope: !1008, file: !861, line: 1915, column: 13)
!1015 = !{!532, !533, !883}
!1016 = !DILocation(line: 1913, column: 22, scope: !1008)
!1017 = !DILocation(line: 1915, column: 17, scope: !1014)
!1018 = !DILocation(line: 1915, column: 17, scope: !1008)
